OpenNuvoton/NuTool-PinConfigure/Header/NUC1263/sys.h
/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function setting constant definitions abbreviation.                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define ACMP0_N_PB4              SYS_GPB_MFPL_PB4MFP_ACMP0_N          /*!< GPB_MFPL PB4 setting for ACMP0_N*/
#define ACMP0_O_PB7              SYS_GPB_MFPL_PB7MFP_ACMP0_O          /*!< GPB_MFPL PB7 setting for ACMP0_O*/
#define ACMP0_O_PC1              SYS_GPC_MFPL_PC1MFP_ACMP0_O          /*!< GPC_MFPL PC1 setting for ACMP0_O*/
#define ACMP0_O_PF0              SYS_GPF_MFPL_PF0MFP_ACMP0_O          /*!< GPF_MFPL PF0 setting for ACMP0_O*/
#define ACMP0_P0_PB2             SYS_GPB_MFPL_PB2MFP_ACMP0_P0         /*!< GPB_MFPL PB2 setting for ACMP0_P0*/
#define ACMP0_P1_PB3             SYS_GPB_MFPL_PB3MFP_ACMP0_P1         /*!< GPB_MFPL PB3 setting for ACMP0_P1*/
#define ACMP0_P2_PB12            SYS_GPB_MFPH_PB12MFP_ACMP0_P2        /*!< GPB_MFPH PB12 setting for ACMP0_P2*/
#define ACMP0_P3_PB13            SYS_GPB_MFPH_PB13MFP_ACMP0_P3        /*!< GPB_MFPH PB13 setting for ACMP0_P3*/
#define ACMP0_WLAT_PA7           SYS_GPA_MFPL_PA7MFP_ACMP0_WLAT       /*!< GPA_MFPL PA7 setting for ACMP0_WLAT*/
#define ACMP1_N_PB5              SYS_GPB_MFPL_PB5MFP_ACMP1_N          /*!< GPB_MFPL PB5 setting for ACMP1_N*/
#define ACMP1_O_PB6              SYS_GPB_MFPL_PB6MFP_ACMP1_O          /*!< GPB_MFPL PB6 setting for ACMP1_O*/
#define ACMP1_O_PC0              SYS_GPC_MFPL_PC0MFP_ACMP1_O          /*!< GPC_MFPL PC0 setting for ACMP1_O*/
#define ACMP1_O_PF1              SYS_GPF_MFPL_PF1MFP_ACMP1_O          /*!< GPF_MFPL PF1 setting for ACMP1_O*/
#define ACMP1_P0_PB3             SYS_GPB_MFPL_PB3MFP_ACMP1_P0         /*!< GPB_MFPL PB3 setting for ACMP1_P0*/
#define ACMP1_P1_PB4             SYS_GPB_MFPL_PB4MFP_ACMP1_P1         /*!< GPB_MFPL PB4 setting for ACMP1_P1*/
#define ACMP1_P2_PB12            SYS_GPB_MFPH_PB12MFP_ACMP1_P2        /*!< GPB_MFPH PB12 setting for ACMP1_P2*/
#define ACMP1_P3_PB13            SYS_GPB_MFPH_PB13MFP_ACMP1_P3        /*!< GPB_MFPH PB13 setting for ACMP1_P3*/
#define ACMP1_WLAT_PA6           SYS_GPA_MFPL_PA6MFP_ACMP1_WLAT       /*!< GPA_MFPL PA6 setting for ACMP1_WLAT*/
#define ACMP2_N_PB6              SYS_GPB_MFPL_PB6MFP_ACMP2_N          /*!< GPB_MFPL PB6 setting for ACMP2_N*/
#define ACMP2_O_PA1              SYS_GPA_MFPL_PA1MFP_ACMP2_O          /*!< GPA_MFPL PA1 setting for ACMP2_O*/
#define ACMP2_O_PF3              SYS_GPF_MFPL_PF3MFP_ACMP2_O          /*!< GPF_MFPL PF3 setting for ACMP2_O*/
#define ACMP2_P0_PB4             SYS_GPB_MFPL_PB4MFP_ACMP2_P0         /*!< GPB_MFPL PB4 setting for ACMP2_P0*/
#define ACMP2_P1_PB5             SYS_GPB_MFPL_PB5MFP_ACMP2_P1         /*!< GPB_MFPL PB5 setting for ACMP2_P1*/
#define ACMP2_P2_PB14            SYS_GPB_MFPH_PB14MFP_ACMP2_P2        /*!< GPB_MFPH PB14 setting for ACMP2_P2*/
#define ACMP2_P3_PB15            SYS_GPB_MFPH_PB15MFP_ACMP2_P3        /*!< GPB_MFPH PB15 setting for ACMP2_P3*/
#define ACMP2_WLAT_PA3           SYS_GPA_MFPL_PA3MFP_ACMP2_WLAT       /*!< GPA_MFPL PA3 setting for ACMP2_WLAT*/
#define ACMP2_WLAT_PF5           SYS_GPF_MFPL_PF5MFP_ACMP2_WLAT       /*!< GPF_MFPL PF5 setting for ACMP2_WLAT*/
#define ACMP3_N_PB7              SYS_GPB_MFPL_PB7MFP_ACMP3_N          /*!< GPB_MFPL PB7 setting for ACMP3_N*/
#define ACMP3_O_PA0              SYS_GPA_MFPL_PA0MFP_ACMP3_O          /*!< GPA_MFPL PA0 setting for ACMP3_O*/
#define ACMP3_O_PF2              SYS_GPF_MFPL_PF2MFP_ACMP3_O          /*!< GPF_MFPL PF2 setting for ACMP3_O*/
#define ACMP3_P0_PB5             SYS_GPB_MFPL_PB5MFP_ACMP3_P0         /*!< GPB_MFPL PB5 setting for ACMP3_P0*/
#define ACMP3_P1_PB6             SYS_GPB_MFPL_PB6MFP_ACMP3_P1         /*!< GPB_MFPL PB6 setting for ACMP3_P1*/
#define ACMP3_P2_PB14            SYS_GPB_MFPH_PB14MFP_ACMP3_P2        /*!< GPB_MFPH PB14 setting for ACMP3_P2*/
#define ACMP3_P3_PB15            SYS_GPB_MFPH_PB15MFP_ACMP3_P3        /*!< GPB_MFPH PB15 setting for ACMP3_P3*/
#define ACMP3_WLAT_PF4           SYS_GPF_MFPL_PF4MFP_ACMP3_WLAT       /*!< GPF_MFPL PF4 setting for ACMP3_WLAT*/
#define ACMP3_WLAT_PA2           SYS_GPA_MFPL_PA2MFP_ACMP3_WLAT       /*!< GPA_MFPL PA2 setting for ACMP3_WLAT*/
#define ADC0_CH0_PB0             SYS_GPB_MFPL_PB0MFP_ADC0_CH0         /*!< GPB_MFPL PB0 setting for ADC0_CH0*/
#define ADC0_CH1_PB1             SYS_GPB_MFPL_PB1MFP_ADC0_CH1         /*!< GPB_MFPL PB1 setting for ADC0_CH1*/
#define ADC0_CH10_PB10           SYS_GPB_MFPH_PB10MFP_ADC0_CH10       /*!< GPB_MFPH PB10 setting for ADC0_CH10*/
#define ADC0_CH11_PB11           SYS_GPB_MFPH_PB11MFP_ADC0_CH11       /*!< GPB_MFPH PB11 setting for ADC0_CH11*/
#define ADC0_CH12_PB12           SYS_GPB_MFPH_PB12MFP_ADC0_CH12       /*!< GPB_MFPH PB12 setting for ADC0_CH12*/
#define ADC0_CH13_PB13           SYS_GPB_MFPH_PB13MFP_ADC0_CH13       /*!< GPB_MFPH PB13 setting for ADC0_CH13*/
#define ADC0_CH14_PB14           SYS_GPB_MFPH_PB14MFP_ADC0_CH14       /*!< GPB_MFPH PB14 setting for ADC0_CH14*/
#define ADC0_CH15_PB15           SYS_GPB_MFPH_PB15MFP_ADC0_CH15       /*!< GPB_MFPH PB15 setting for ADC0_CH15*/
#define ADC0_CH2_PB2             SYS_GPB_MFPL_PB2MFP_ADC0_CH2         /*!< GPB_MFPL PB2 setting for ADC0_CH2*/
#define ADC0_CH3_PB3             SYS_GPB_MFPL_PB3MFP_ADC0_CH3         /*!< GPB_MFPL PB3 setting for ADC0_CH3*/
#define ADC0_CH4_PB4             SYS_GPB_MFPL_PB4MFP_ADC0_CH4         /*!< GPB_MFPL PB4 setting for ADC0_CH4*/
#define ADC0_CH5_PB5             SYS_GPB_MFPL_PB5MFP_ADC0_CH5         /*!< GPB_MFPL PB5 setting for ADC0_CH5*/
#define ADC0_CH6_PB6             SYS_GPB_MFPL_PB6MFP_ADC0_CH6         /*!< GPB_MFPL PB6 setting for ADC0_CH6*/
#define ADC0_CH7_PB7             SYS_GPB_MFPL_PB7MFP_ADC0_CH7         /*!< GPB_MFPL PB7 setting for ADC0_CH7*/
#define ADC0_CH8_PB8             SYS_GPB_MFPH_PB8MFP_ADC0_CH8         /*!< GPB_MFPH PB8 setting for ADC0_CH8*/
#define ADC0_CH9_PB9             SYS_GPB_MFPH_PB9MFP_ADC0_CH9         /*!< GPB_MFPH PB9 setting for ADC0_CH9*/
#define ADC0_ST_PF5              SYS_GPF_MFPL_PF5MFP_ADC0_ST          /*!< GPF_MFPL PF5 setting for ADC0_ST*/
#define ADC0_ST_PC1              SYS_GPC_MFPL_PC1MFP_ADC0_ST          /*!< GPC_MFPL PC1 setting for ADC0_ST*/
#define BPWM0_CH0_PA0            SYS_GPA_MFPL_PA0MFP_BPWM0_CH0        /*!< GPA_MFPL PA0 setting for BPWM0_CH0*/
#define BPWM0_CH0_PA11           SYS_GPA_MFPH_PA11MFP_BPWM0_CH0       /*!< GPA_MFPH PA11 setting for BPWM0_CH0*/
#define BPWM0_CH1_PA10           SYS_GPA_MFPH_PA10MFP_BPWM0_CH1       /*!< GPA_MFPH PA10 setting for BPWM0_CH1*/
#define BPWM0_CH1_PA1            SYS_GPA_MFPL_PA1MFP_BPWM0_CH1        /*!< GPA_MFPL PA1 setting for BPWM0_CH1*/
#define BPWM0_CH2_PA2            SYS_GPA_MFPL_PA2MFP_BPWM0_CH2        /*!< GPA_MFPL PA2 setting for BPWM0_CH2*/
#define BPWM0_CH2_PA9            SYS_GPA_MFPH_PA9MFP_BPWM0_CH2        /*!< GPA_MFPH PA9 setting for BPWM0_CH2*/
#define BPWM0_CH3_PA3            SYS_GPA_MFPL_PA3MFP_BPWM0_CH3        /*!< GPA_MFPL PA3 setting for BPWM0_CH3*/
#define BPWM0_CH3_PF3            SYS_GPF_MFPL_PF3MFP_BPWM0_CH3        /*!< GPF_MFPL PF3 setting for BPWM0_CH3*/
#define BPWM0_CH3_PA8            SYS_GPA_MFPH_PA8MFP_BPWM0_CH3        /*!< GPA_MFPH PA8 setting for BPWM0_CH3*/
#define BPWM0_CH4_PA4            SYS_GPA_MFPL_PA4MFP_BPWM0_CH4        /*!< GPA_MFPL PA4 setting for BPWM0_CH4*/
#define BPWM0_CH4_PF5            SYS_GPF_MFPL_PF5MFP_BPWM0_CH4        /*!< GPF_MFPL PF5 setting for BPWM0_CH4*/
#define BPWM0_CH5_PA5            SYS_GPA_MFPL_PA5MFP_BPWM0_CH5        /*!< GPA_MFPL PA5 setting for BPWM0_CH5*/
#define BPWM0_CH5_PF4            SYS_GPF_MFPL_PF4MFP_BPWM0_CH5        /*!< GPF_MFPL PF4 setting for BPWM0_CH5*/
#define BPWM1_CH0_PB11           SYS_GPB_MFPH_PB11MFP_BPWM1_CH0       /*!< GPB_MFPH PB11 setting for BPWM1_CH0*/
#define BPWM1_CH0_PF3            SYS_GPF_MFPL_PF3MFP_BPWM1_CH0        /*!< GPF_MFPL PF3 setting for BPWM1_CH0*/
#define BPWM1_CH0_PC7            SYS_GPC_MFPL_PC7MFP_BPWM1_CH0        /*!< GPC_MFPL PC7 setting for BPWM1_CH0*/
#define BPWM1_CH0_PF0            SYS_GPF_MFPL_PF0MFP_BPWM1_CH0        /*!< GPF_MFPL PF0 setting for BPWM1_CH0*/
#define BPWM1_CH0_PF15           SYS_GPF_MFPH_PF15MFP_BPWM1_CH0       /*!< GPF_MFPH PF15 setting for BPWM1_CH0*/
#define BPWM1_CH1_PC6            SYS_GPC_MFPL_PC6MFP_BPWM1_CH1        /*!< GPC_MFPL PC6 setting for BPWM1_CH1*/
#define BPWM1_CH1_PF2            SYS_GPF_MFPL_PF2MFP_BPWM1_CH1        /*!< GPF_MFPL PF2 setting for BPWM1_CH1*/
#define BPWM1_CH1_PB10           SYS_GPB_MFPH_PB10MFP_BPWM1_CH1       /*!< GPB_MFPH PB10 setting for BPWM1_CH1*/
#define BPWM1_CH1_PF1            SYS_GPF_MFPL_PF1MFP_BPWM1_CH1        /*!< GPF_MFPL PF1 setting for BPWM1_CH1*/
#define BPWM1_CH2_PA7            SYS_GPA_MFPL_PA7MFP_BPWM1_CH2        /*!< GPA_MFPL PA7 setting for BPWM1_CH2*/
#define BPWM1_CH2_PB9            SYS_GPB_MFPH_PB9MFP_BPWM1_CH2        /*!< GPB_MFPH PB9 setting for BPWM1_CH2*/
#define BPWM1_CH3_PA6            SYS_GPA_MFPL_PA6MFP_BPWM1_CH3        /*!< GPA_MFPL PA6 setting for BPWM1_CH3*/
#define BPWM1_CH3_PB8            SYS_GPB_MFPH_PB8MFP_BPWM1_CH3        /*!< GPB_MFPH PB8 setting for BPWM1_CH3*/
#define BPWM1_CH4_PB7            SYS_GPB_MFPL_PB7MFP_BPWM1_CH4        /*!< GPB_MFPL PB7 setting for BPWM1_CH4*/
#define BPWM1_CH5_PB6            SYS_GPB_MFPL_PB6MFP_BPWM1_CH5        /*!< GPB_MFPL PB6 setting for BPWM1_CH5*/
#define BPWM2_CH0_PA5            SYS_GPA_MFPL_PA5MFP_BPWM2_CH0        /*!< GPA_MFPL PA5 setting for BPWM2_CH0*/
#define BPWM2_CH0_PF5            SYS_GPF_MFPL_PF5MFP_BPWM2_CH0        /*!< GPF_MFPL PF5 setting for BPWM2_CH0*/
#define BPWM2_CH0_PB5            SYS_GPB_MFPL_PB5MFP_BPWM2_CH0        /*!< GPB_MFPL PB5 setting for BPWM2_CH0*/
#define BPWM2_CH1_PF4            SYS_GPF_MFPL_PF4MFP_BPWM2_CH1        /*!< GPF_MFPL PF4 setting for BPWM2_CH1*/
#define BPWM2_CH1_PA4            SYS_GPA_MFPL_PA4MFP_BPWM2_CH1        /*!< GPA_MFPL PA4 setting for BPWM2_CH1*/
#define BPWM2_CH1_PB4            SYS_GPB_MFPL_PB4MFP_BPWM2_CH1        /*!< GPB_MFPL PB4 setting for BPWM2_CH1*/
#define BPWM2_CH1_PC1            SYS_GPC_MFPL_PC1MFP_BPWM2_CH1        /*!< GPC_MFPL PC1 setting for BPWM2_CH1*/
#define BPWM2_CH2_PA3            SYS_GPA_MFPL_PA3MFP_BPWM2_CH2        /*!< GPA_MFPL PA3 setting for BPWM2_CH2*/
#define BPWM2_CH2_PB3            SYS_GPB_MFPL_PB3MFP_BPWM2_CH2        /*!< GPB_MFPL PB3 setting for BPWM2_CH2*/
#define BPWM2_CH3_PA2            SYS_GPA_MFPL_PA2MFP_BPWM2_CH3        /*!< GPA_MFPL PA2 setting for BPWM2_CH3*/
#define BPWM2_CH3_PB2            SYS_GPB_MFPL_PB2MFP_BPWM2_CH3        /*!< GPB_MFPL PB2 setting for BPWM2_CH3*/
#define BPWM2_CH4_PB1            SYS_GPB_MFPL_PB1MFP_BPWM2_CH4        /*!< GPB_MFPL PB1 setting for BPWM2_CH4*/
#define BPWM2_CH4_PF6            SYS_GPF_MFPL_PF6MFP_BPWM2_CH4        /*!< GPF_MFPL PF6 setting for BPWM2_CH4*/
#define BPWM2_CH4_PF14           SYS_GPF_MFPH_PF14MFP_BPWM2_CH4       /*!< GPF_MFPH PF14 setting for BPWM2_CH4*/
#define BPWM2_CH4_PA1            SYS_GPA_MFPL_PA1MFP_BPWM2_CH4        /*!< GPA_MFPL PA1 setting for BPWM2_CH4*/
#define BPWM2_CH5_PD15           SYS_GPD_MFPH_PD15MFP_BPWM2_CH5       /*!< GPD_MFPH PD15 setting for BPWM2_CH5*/
#define BPWM2_CH5_PA0            SYS_GPA_MFPL_PA0MFP_BPWM2_CH5        /*!< GPA_MFPL PA0 setting for BPWM2_CH5*/
#define BPWM2_CH5_PB0            SYS_GPB_MFPL_PB0MFP_BPWM2_CH5        /*!< GPB_MFPL PB0 setting for BPWM2_CH5*/
#define BPWM2_CH5_PF4            SYS_GPF_MFPL_PF4MFP_BPWM2_CH5        /*!< GPF_MFPL PF4 setting for BPWM2_CH5*/
#define BPWM3_CH0_PC5            SYS_GPC_MFPL_PC5MFP_BPWM3_CH0        /*!< GPC_MFPL PC5 setting for BPWM3_CH0*/
#define BPWM3_CH0_PB15           SYS_GPB_MFPH_PB15MFP_BPWM3_CH0       /*!< GPB_MFPH PB15 setting for BPWM3_CH0*/
#define BPWM3_CH1_PB14           SYS_GPB_MFPH_PB14MFP_BPWM3_CH1       /*!< GPB_MFPH PB14 setting for BPWM3_CH1*/
#define BPWM3_CH1_PC4            SYS_GPC_MFPL_PC4MFP_BPWM3_CH1        /*!< GPC_MFPL PC4 setting for BPWM3_CH1*/
#define BPWM3_CH2_PB13           SYS_GPB_MFPH_PB13MFP_BPWM3_CH2       /*!< GPB_MFPH PB13 setting for BPWM3_CH2*/
#define BPWM3_CH2_PC7            SYS_GPC_MFPL_PC7MFP_BPWM3_CH2        /*!< GPC_MFPL PC7 setting for BPWM3_CH2*/
#define BPWM3_CH2_PC3            SYS_GPC_MFPL_PC3MFP_BPWM3_CH2        /*!< GPC_MFPL PC3 setting for BPWM3_CH2*/
#define BPWM3_CH3_PB12           SYS_GPB_MFPH_PB12MFP_BPWM3_CH3       /*!< GPB_MFPH PB12 setting for BPWM3_CH3*/
#define BPWM3_CH3_PC0            SYS_GPC_MFPL_PC0MFP_BPWM3_CH3        /*!< GPC_MFPL PC0 setting for BPWM3_CH3*/
#define BPWM3_CH3_PC2            SYS_GPC_MFPL_PC2MFP_BPWM3_CH3        /*!< GPC_MFPL PC2 setting for BPWM3_CH3*/
#define BPWM3_CH3_PC6            SYS_GPC_MFPL_PC6MFP_BPWM3_CH3        /*!< GPC_MFPL PC6 setting for BPWM3_CH3*/
#define BPWM3_CH4_PC1            SYS_GPC_MFPL_PC1MFP_BPWM3_CH4        /*!< GPC_MFPL PC1 setting for BPWM3_CH4*/
#define BPWM3_CH4_PA7            SYS_GPA_MFPL_PA7MFP_BPWM3_CH4        /*!< GPA_MFPL PA7 setting for BPWM3_CH4*/
#define BPWM3_CH4_PB7            SYS_GPB_MFPL_PB7MFP_BPWM3_CH4        /*!< GPB_MFPL PB7 setting for BPWM3_CH4*/
#define BPWM3_CH4_PB1            SYS_GPB_MFPL_PB1MFP_BPWM3_CH4        /*!< GPB_MFPL PB1 setting for BPWM3_CH4*/
#define BPWM3_CH5_PB6            SYS_GPB_MFPL_PB6MFP_BPWM3_CH5        /*!< GPB_MFPL PB6 setting for BPWM3_CH5*/
#define BPWM3_CH5_PF4            SYS_GPF_MFPL_PF4MFP_BPWM3_CH5        /*!< GPF_MFPL PF4 setting for BPWM3_CH5*/
#define BPWM3_CH5_PC0            SYS_GPC_MFPL_PC0MFP_BPWM3_CH5        /*!< GPC_MFPL PC0 setting for BPWM3_CH5*/
#define BPWM3_CH5_PA6            SYS_GPA_MFPL_PA6MFP_BPWM3_CH5        /*!< GPA_MFPL PA6 setting for BPWM3_CH5*/
#define BPWM3_CH5_PB0            SYS_GPB_MFPL_PB0MFP_BPWM3_CH5        /*!< GPB_MFPL PB0 setting for BPWM3_CH5*/
#define CLKO_PF6                 SYS_GPF_MFPL_PF6MFP_CLKO             /*!< GPF_MFPL PF6 setting for CLKO*/
#define CLKO_PB14                SYS_GPB_MFPH_PB14MFP_CLKO            /*!< GPB_MFPH PB14 setting for CLKO*/
#define CLKO_PF14                SYS_GPF_MFPH_PF14MFP_CLKO            /*!< GPF_MFPH PF14 setting for CLKO*/
#define CLKO_PA3                 SYS_GPA_MFPL_PA3MFP_CLKO             /*!< GPA_MFPL PA3 setting for CLKO*/
#define CLKO_PF15                SYS_GPF_MFPH_PF15MFP_CLKO            /*!< GPF_MFPH PF15 setting for CLKO*/
#define DAC0_OUT_PB12            SYS_GPB_MFPH_PB12MFP_DAC0_OUT        /*!< GPB_MFPH PB12 setting for DAC0_OUT*/
#define DAC0_ST_PA10             SYS_GPA_MFPH_PA10MFP_DAC0_ST         /*!< GPA_MFPH PA10 setting for DAC0_ST*/
#define DAC0_ST_PA0              SYS_GPA_MFPL_PA0MFP_DAC0_ST          /*!< GPA_MFPL PA0 setting for DAC0_ST*/
#define DAC1_OUT_PB13            SYS_GPB_MFPH_PB13MFP_DAC1_OUT        /*!< GPB_MFPH PB13 setting for DAC1_OUT*/
#define DAC1_ST_PC14             SYS_GPC_MFPH_PC14MFP_DAC1_ST         /*!< GPC_MFPH PC14 setting for DAC1_ST*/
#define DAC1_ST_PA11             SYS_GPA_MFPH_PA11MFP_DAC1_ST         /*!< GPA_MFPH PA11 setting for DAC1_ST*/
#define DAC2_OUT_PB14            SYS_GPB_MFPH_PB14MFP_DAC2_OUT        /*!< GPB_MFPH PB14 setting for DAC2_OUT*/
#define DAC2_ST_PA9              SYS_GPA_MFPH_PA9MFP_DAC2_ST          /*!< GPA_MFPH PA9 setting for DAC2_ST*/
#define DAC2_ST_PA5              SYS_GPA_MFPL_PA5MFP_DAC2_ST          /*!< GPA_MFPL PA5 setting for DAC2_ST*/
#define DAC3_OUT_PB15            SYS_GPB_MFPH_PB15MFP_DAC3_OUT        /*!< GPB_MFPH PB15 setting for DAC3_OUT*/
#define DAC3_ST_PA4              SYS_GPA_MFPL_PA4MFP_DAC3_ST          /*!< GPA_MFPL PA4 setting for DAC3_ST*/
#define DAC3_ST_PA8              SYS_GPA_MFPH_PA8MFP_DAC3_ST          /*!< GPA_MFPH PA8 setting for DAC3_ST*/
#define I2C0_SCL_PA8             SYS_GPA_MFPH_PA8MFP_I2C0_SCL         /*!< GPA_MFPH PA8 setting for I2C0_SCL*/
#define I2C0_SCL_PB5             SYS_GPB_MFPL_PB5MFP_I2C0_SCL         /*!< GPB_MFPL PB5 setting for I2C0_SCL*/
#define I2C0_SCL_PB9             SYS_GPB_MFPH_PB9MFP_I2C0_SCL         /*!< GPB_MFPH PB9 setting for I2C0_SCL*/
#define I2C0_SCL_PF3             SYS_GPF_MFPL_PF3MFP_I2C0_SCL         /*!< GPF_MFPL PF3 setting for I2C0_SCL*/
#define I2C0_SCL_PA5             SYS_GPA_MFPL_PA5MFP_I2C0_SCL         /*!< GPA_MFPL PA5 setting for I2C0_SCL*/
#define I2C0_SCL_PC1             SYS_GPC_MFPL_PC1MFP_I2C0_SCL         /*!< GPC_MFPL PC1 setting for I2C0_SCL*/
#define I2C0_SCL_PC3             SYS_GPC_MFPL_PC3MFP_I2C0_SCL         /*!< GPC_MFPL PC3 setting for I2C0_SCL*/
#define I2C0_SCL_PF5             SYS_GPF_MFPL_PF5MFP_I2C0_SCL         /*!< GPF_MFPL PF5 setting for I2C0_SCL*/
#define I2C0_SDA_PA4             SYS_GPA_MFPL_PA4MFP_I2C0_SDA         /*!< GPA_MFPL PA4 setting for I2C0_SDA*/
#define I2C0_SDA_PF6             SYS_GPF_MFPL_PF6MFP_I2C0_SDA         /*!< GPF_MFPL PF6 setting for I2C0_SDA*/
#define I2C0_SDA_PC0             SYS_GPC_MFPL_PC0MFP_I2C0_SDA         /*!< GPC_MFPL PC0 setting for I2C0_SDA*/
#define I2C0_SDA_PC2             SYS_GPC_MFPL_PC2MFP_I2C0_SDA         /*!< GPC_MFPL PC2 setting for I2C0_SDA*/
#define I2C0_SDA_PF2             SYS_GPF_MFPL_PF2MFP_I2C0_SDA         /*!< GPF_MFPL PF2 setting for I2C0_SDA*/
#define I2C0_SDA_PB8             SYS_GPB_MFPH_PB8MFP_I2C0_SDA         /*!< GPB_MFPH PB8 setting for I2C0_SDA*/
#define I2C0_SDA_PB4             SYS_GPB_MFPL_PB4MFP_I2C0_SDA         /*!< GPB_MFPL PB4 setting for I2C0_SDA*/
#define I2C0_SDA_PF4             SYS_GPF_MFPL_PF4MFP_I2C0_SDA         /*!< GPF_MFPL PF4 setting for I2C0_SDA*/
#define I2C0_SMBAL_PC3           SYS_GPC_MFPL_PC3MFP_I2C0_SMBAL       /*!< GPC_MFPL PC3 setting for I2C0_SMBAL*/
#define I2C0_SMBAL_PA3           SYS_GPA_MFPL_PA3MFP_I2C0_SMBAL       /*!< GPA_MFPL PA3 setting for I2C0_SMBAL*/
#define I2C0_SMBSUS_PA2          SYS_GPA_MFPL_PA2MFP_I2C0_SMBSUS      /*!< GPA_MFPL PA2 setting for I2C0_SMBSUS*/
#define I2C0_SMBSUS_PC2          SYS_GPC_MFPL_PC2MFP_I2C0_SMBSUS      /*!< GPC_MFPL PC2 setting for I2C0_SMBSUS*/
#define I2C1_SCL_PC1             SYS_GPC_MFPL_PC1MFP_I2C1_SCL         /*!< GPC_MFPL PC1 setting for I2C1_SCL*/
#define I2C1_SCL_PA10            SYS_GPA_MFPH_PA10MFP_I2C1_SCL        /*!< GPA_MFPH PA10 setting for I2C1_SCL*/
#define I2C1_SCL_PA7             SYS_GPA_MFPL_PA7MFP_I2C1_SCL         /*!< GPA_MFPL PA7 setting for I2C1_SCL*/
#define I2C1_SCL_PA3             SYS_GPA_MFPL_PA3MFP_I2C1_SCL         /*!< GPA_MFPL PA3 setting for I2C1_SCL*/
#define I2C1_SCL_PB11            SYS_GPB_MFPH_PB11MFP_I2C1_SCL        /*!< GPB_MFPH PB11 setting for I2C1_SCL*/
#define I2C1_SCL_PB1             SYS_GPB_MFPL_PB1MFP_I2C1_SCL         /*!< GPB_MFPL PB1 setting for I2C1_SCL*/
#define I2C1_SCL_PF0             SYS_GPF_MFPL_PF0MFP_I2C1_SCL         /*!< GPF_MFPL PF0 setting for I2C1_SCL*/
#define I2C1_SCL_PC5             SYS_GPC_MFPL_PC5MFP_I2C1_SCL         /*!< GPC_MFPL PC5 setting for I2C1_SCL*/
#define I2C1_SCL_PB3             SYS_GPB_MFPL_PB3MFP_I2C1_SCL         /*!< GPB_MFPL PB3 setting for I2C1_SCL*/
#define I2C1_SDA_PC0             SYS_GPC_MFPL_PC0MFP_I2C1_SDA         /*!< GPC_MFPL PC0 setting for I2C1_SDA*/
#define I2C1_SDA_PB0             SYS_GPB_MFPL_PB0MFP_I2C1_SDA         /*!< GPB_MFPL PB0 setting for I2C1_SDA*/
#define I2C1_SDA_PA2             SYS_GPA_MFPL_PA2MFP_I2C1_SDA         /*!< GPA_MFPL PA2 setting for I2C1_SDA*/
#define I2C1_SDA_PC4             SYS_GPC_MFPL_PC4MFP_I2C1_SDA         /*!< GPC_MFPL PC4 setting for I2C1_SDA*/
#define I2C1_SDA_PB2             SYS_GPB_MFPL_PB2MFP_I2C1_SDA         /*!< GPB_MFPL PB2 setting for I2C1_SDA*/
#define I2C1_SDA_PA9             SYS_GPA_MFPH_PA9MFP_I2C1_SDA         /*!< GPA_MFPH PA9 setting for I2C1_SDA*/
#define I2C1_SDA_PB10            SYS_GPB_MFPH_PB10MFP_I2C1_SDA        /*!< GPB_MFPH PB10 setting for I2C1_SDA*/
#define I2C1_SDA_PA6             SYS_GPA_MFPL_PA6MFP_I2C1_SDA         /*!< GPA_MFPL PA6 setting for I2C1_SDA*/
#define I2C1_SDA_PF1             SYS_GPF_MFPL_PF1MFP_I2C1_SDA         /*!< GPF_MFPL PF1 setting for I2C1_SDA*/
#define I2C1_SMBAL_PC7           SYS_GPC_MFPL_PC7MFP_I2C1_SMBAL       /*!< GPC_MFPL PC7 setting for I2C1_SMBAL*/
#define I2C1_SMBAL_PB9           SYS_GPB_MFPH_PB9MFP_I2C1_SMBAL       /*!< GPB_MFPH PB9 setting for I2C1_SMBAL*/
#define I2C1_SMBAL_PF0           SYS_GPF_MFPL_PF0MFP_I2C1_SMBAL       /*!< GPF_MFPL PF0 setting for I2C1_SMBAL*/
#define I2C1_SMBSUS_PB8          SYS_GPB_MFPH_PB8MFP_I2C1_SMBSUS      /*!< GPB_MFPH PB8 setting for I2C1_SMBSUS*/
#define I2C1_SMBSUS_PC6          SYS_GPC_MFPL_PC6MFP_I2C1_SMBSUS      /*!< GPC_MFPL PC6 setting for I2C1_SMBSUS*/
#define I2C1_SMBSUS_PF1          SYS_GPF_MFPL_PF1MFP_I2C1_SMBSUS      /*!< GPF_MFPL PF1 setting for I2C1_SMBSUS*/
#define I2C2_SCL_PB3             SYS_GPB_MFPL_PB3MFP_I2C2_SCL         /*!< GPB_MFPL PB3 setting for I2C2_SCL*/
#define I2C2_SCL_PA11            SYS_GPA_MFPH_PA11MFP_I2C2_SCL        /*!< GPA_MFPH PA11 setting for I2C2_SCL*/
#define I2C2_SCL_PF0             SYS_GPF_MFPL_PF0MFP_I2C2_SCL         /*!< GPF_MFPL PF0 setting for I2C2_SCL*/
#define I2C2_SCL_PA1             SYS_GPA_MFPL_PA1MFP_I2C2_SCL         /*!< GPA_MFPL PA1 setting for I2C2_SCL*/
#define I2C2_SCL_PB13            SYS_GPB_MFPH_PB13MFP_I2C2_SCL        /*!< GPB_MFPH PB13 setting for I2C2_SCL*/
#define I2C2_SDA_PA0             SYS_GPA_MFPL_PA0MFP_I2C2_SDA         /*!< GPA_MFPL PA0 setting for I2C2_SDA*/
#define I2C2_SDA_PF1             SYS_GPF_MFPL_PF1MFP_I2C2_SDA         /*!< GPF_MFPL PF1 setting for I2C2_SDA*/
#define I2C2_SDA_PA10            SYS_GPA_MFPH_PA10MFP_I2C2_SDA        /*!< GPA_MFPH PA10 setting for I2C2_SDA*/
#define I2C2_SDA_PB2             SYS_GPB_MFPL_PB2MFP_I2C2_SDA         /*!< GPB_MFPL PB2 setting for I2C2_SDA*/
#define I2C2_SDA_PB12            SYS_GPB_MFPH_PB12MFP_I2C2_SDA        /*!< GPB_MFPH PB12 setting for I2C2_SDA*/
#define I2C2_SMBAL_PB15          SYS_GPB_MFPH_PB15MFP_I2C2_SMBAL      /*!< GPB_MFPH PB15 setting for I2C2_SMBAL*/
#define I2C2_SMBAL_PC3           SYS_GPC_MFPL_PC3MFP_I2C2_SMBAL       /*!< GPC_MFPL PC3 setting for I2C2_SMBAL*/
#define I2C2_SMBSUS_PB14         SYS_GPB_MFPH_PB14MFP_I2C2_SMBSUS     /*!< GPB_MFPH PB14 setting for I2C2_SMBSUS*/
#define I2C2_SMBSUS_PC2          SYS_GPC_MFPL_PC2MFP_I2C2_SMBSUS      /*!< GPC_MFPL PC2 setting for I2C2_SMBSUS*/
#define I3C0_SCL_PA5             SYS_GPA_MFPL_PA5MFP_I3C0_SCL         /*!< GPA_MFPL PA5 setting for I3C0_SCL*/
#define I3C0_SCL_PA1             SYS_GPA_MFPL_PA1MFP_I3C0_SCL         /*!< GPA_MFPL PA1 setting for I3C0_SCL*/
#define I3C0_SDA_PA0             SYS_GPA_MFPL_PA0MFP_I3C0_SDA         /*!< GPA_MFPL PA0 setting for I3C0_SDA*/
#define I3C0_SDA_PA4             SYS_GPA_MFPL_PA4MFP_I3C0_SDA         /*!< GPA_MFPL PA4 setting for I3C0_SDA*/
#define I3C1_SCL_PA3             SYS_GPA_MFPL_PA3MFP_I3C1_SCL         /*!< GPA_MFPL PA3 setting for I3C1_SCL*/
#define I3C1_SDA_PA2             SYS_GPA_MFPL_PA2MFP_I3C1_SDA         /*!< GPA_MFPL PA2 setting for I3C1_SDA*/
#define ICE_CLK_PF1              SYS_GPF_MFPL_PF1MFP_ICE_CLK          /*!< GPF_MFPL PF1 setting for ICE_CLK*/
#define ICE_DAT_PF0              SYS_GPF_MFPL_PF0MFP_ICE_DAT          /*!< GPF_MFPL PF0 setting for ICE_DAT*/
#define INT0_PA6                 SYS_GPA_MFPL_PA6MFP_INT0             /*!< GPA_MFPL PA6 setting for INT0*/
#define INT0_PB5                 SYS_GPB_MFPL_PB5MFP_INT0             /*!< GPB_MFPL PB5 setting for INT0*/
#define INT1_PB4                 SYS_GPB_MFPL_PB4MFP_INT1             /*!< GPB_MFPL PB4 setting for INT1*/
#define INT1_PD15                SYS_GPD_MFPH_PD15MFP_INT1            /*!< GPD_MFPH PD15 setting for INT1*/
#define INT1_PA7                 SYS_GPA_MFPL_PA7MFP_INT1             /*!< GPA_MFPL PA7 setting for INT1*/
#define INT2_PC6                 SYS_GPC_MFPL_PC6MFP_INT2             /*!< GPC_MFPL PC6 setting for INT2*/
#define INT2_PB3                 SYS_GPB_MFPL_PB3MFP_INT2             /*!< GPB_MFPL PB3 setting for INT2*/
#define INT3_PB2                 SYS_GPB_MFPL_PB2MFP_INT3             /*!< GPB_MFPL PB2 setting for INT3*/
