OpenNuvoton/NuTool-PinConfigure/Header/NUC1263/sys.h
/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function setting mask constant definitions abbreviation.                                         */
/*---------------------------------------------------------------------------------------------------------*/
#define ACMP0_N_PB4_Msk         SYS_GPB_MFPL_PB4MFP_Msk        /*!< ACMP0_N         PB4      MFP Mask */
#define ACMP0_O_PB7_Msk         SYS_GPB_MFPL_PB7MFP_Msk        /*!< ACMP0_O         PB7      MFP Mask */
#define ACMP0_O_PC1_Msk         SYS_GPC_MFPL_PC1MFP_Msk        /*!< ACMP0_O         PC1      MFP Mask */
#define ACMP0_O_PF0_Msk         SYS_GPF_MFPL_PF0MFP_Msk        /*!< ACMP0_O         PF0      MFP Mask */
#define ACMP0_P0_PB2_Msk        SYS_GPB_MFPL_PB2MFP_Msk        /*!< ACMP0_P0        PB2      MFP Mask */
#define ACMP0_P1_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< ACMP0_P1        PB3      MFP Mask */
#define ACMP0_P2_PB12_Msk       SYS_GPB_MFPH_PB12MFP_Msk       /*!< ACMP0_P2        PB12     MFP Mask */
#define ACMP0_P3_PB13_Msk       SYS_GPB_MFPH_PB13MFP_Msk       /*!< ACMP0_P3        PB13     MFP Mask */
#define ACMP0_WLAT_PA7_Msk      SYS_GPA_MFPL_PA7MFP_Msk        /*!< ACMP0_WLAT      PA7      MFP Mask */
#define ACMP1_N_PB5_Msk         SYS_GPB_MFPL_PB5MFP_Msk        /*!< ACMP1_N         PB5      MFP Mask */
#define ACMP1_O_PB6_Msk         SYS_GPB_MFPL_PB6MFP_Msk        /*!< ACMP1_O         PB6      MFP Mask */
#define ACMP1_O_PC0_Msk         SYS_GPC_MFPL_PC0MFP_Msk        /*!< ACMP1_O         PC0      MFP Mask */
#define ACMP1_O_PF1_Msk         SYS_GPF_MFPL_PF1MFP_Msk        /*!< ACMP1_O         PF1      MFP Mask */
#define ACMP1_P0_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< ACMP1_P0        PB3      MFP Mask */
#define ACMP1_P1_PB4_Msk        SYS_GPB_MFPL_PB4MFP_Msk        /*!< ACMP1_P1        PB4      MFP Mask */
#define ACMP1_P2_PB12_Msk       SYS_GPB_MFPH_PB12MFP_Msk       /*!< ACMP1_P2        PB12     MFP Mask */
#define ACMP1_P3_PB13_Msk       SYS_GPB_MFPH_PB13MFP_Msk       /*!< ACMP1_P3        PB13     MFP Mask */
#define ACMP1_WLAT_PA6_Msk      SYS_GPA_MFPL_PA6MFP_Msk        /*!< ACMP1_WLAT      PA6      MFP Mask */
#define ACMP2_N_PB6_Msk         SYS_GPB_MFPL_PB6MFP_Msk        /*!< ACMP2_N         PB6      MFP Mask */
#define ACMP2_O_PA1_Msk         SYS_GPA_MFPL_PA1MFP_Msk        /*!< ACMP2_O         PA1      MFP Mask */
#define ACMP2_O_PF3_Msk         SYS_GPF_MFPL_PF3MFP_Msk        /*!< ACMP2_O         PF3      MFP Mask */
#define ACMP2_P0_PB4_Msk        SYS_GPB_MFPL_PB4MFP_Msk        /*!< ACMP2_P0        PB4      MFP Mask */
#define ACMP2_P1_PB5_Msk        SYS_GPB_MFPL_PB5MFP_Msk        /*!< ACMP2_P1        PB5      MFP Mask */
#define ACMP2_P2_PB14_Msk       SYS_GPB_MFPH_PB14MFP_Msk       /*!< ACMP2_P2        PB14     MFP Mask */
#define ACMP2_P3_PB15_Msk       SYS_GPB_MFPH_PB15MFP_Msk       /*!< ACMP2_P3        PB15     MFP Mask */
#define ACMP2_WLAT_PA3_Msk      SYS_GPA_MFPL_PA3MFP_Msk        /*!< ACMP2_WLAT      PA3      MFP Mask */
#define ACMP2_WLAT_PF5_Msk      SYS_GPF_MFPL_PF5MFP_Msk        /*!< ACMP2_WLAT      PF5      MFP Mask */
#define ACMP3_N_PB7_Msk         SYS_GPB_MFPL_PB7MFP_Msk        /*!< ACMP3_N         PB7      MFP Mask */
#define ACMP3_O_PA0_Msk         SYS_GPA_MFPL_PA0MFP_Msk        /*!< ACMP3_O         PA0      MFP Mask */
#define ACMP3_O_PF2_Msk         SYS_GPF_MFPL_PF2MFP_Msk        /*!< ACMP3_O         PF2      MFP Mask */
#define ACMP3_P0_PB5_Msk        SYS_GPB_MFPL_PB5MFP_Msk        /*!< ACMP3_P0        PB5      MFP Mask */
#define ACMP3_P1_PB6_Msk        SYS_GPB_MFPL_PB6MFP_Msk        /*!< ACMP3_P1        PB6      MFP Mask */
#define ACMP3_P2_PB14_Msk       SYS_GPB_MFPH_PB14MFP_Msk       /*!< ACMP3_P2        PB14     MFP Mask */
#define ACMP3_P3_PB15_Msk       SYS_GPB_MFPH_PB15MFP_Msk       /*!< ACMP3_P3        PB15     MFP Mask */
#define ACMP3_WLAT_PF4_Msk      SYS_GPF_MFPL_PF4MFP_Msk        /*!< ACMP3_WLAT      PF4      MFP Mask */
#define ACMP3_WLAT_PA2_Msk      SYS_GPA_MFPL_PA2MFP_Msk        /*!< ACMP3_WLAT      PA2      MFP Mask */
#define ADC0_CH0_PB0_Msk        SYS_GPB_MFPL_PB0MFP_Msk        /*!< ADC0_CH0        PB0      MFP Mask */
#define ADC0_CH1_PB1_Msk        SYS_GPB_MFPL_PB1MFP_Msk        /*!< ADC0_CH1        PB1      MFP Mask */
#define ADC0_CH10_PB10_Msk      SYS_GPB_MFPH_PB10MFP_Msk       /*!< ADC0_CH10       PB10     MFP Mask */
#define ADC0_CH11_PB11_Msk      SYS_GPB_MFPH_PB11MFP_Msk       /*!< ADC0_CH11       PB11     MFP Mask */
#define ADC0_CH12_PB12_Msk      SYS_GPB_MFPH_PB12MFP_Msk       /*!< ADC0_CH12       PB12     MFP Mask */
#define ADC0_CH13_PB13_Msk      SYS_GPB_MFPH_PB13MFP_Msk       /*!< ADC0_CH13       PB13     MFP Mask */
#define ADC0_CH14_PB14_Msk      SYS_GPB_MFPH_PB14MFP_Msk       /*!< ADC0_CH14       PB14     MFP Mask */
#define ADC0_CH15_PB15_Msk      SYS_GPB_MFPH_PB15MFP_Msk       /*!< ADC0_CH15       PB15     MFP Mask */
#define ADC0_CH2_PB2_Msk        SYS_GPB_MFPL_PB2MFP_Msk        /*!< ADC0_CH2        PB2      MFP Mask */
#define ADC0_CH3_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< ADC0_CH3        PB3      MFP Mask */
#define ADC0_CH4_PB4_Msk        SYS_GPB_MFPL_PB4MFP_Msk        /*!< ADC0_CH4        PB4      MFP Mask */
#define ADC0_CH5_PB5_Msk        SYS_GPB_MFPL_PB5MFP_Msk        /*!< ADC0_CH5        PB5      MFP Mask */
#define ADC0_CH6_PB6_Msk        SYS_GPB_MFPL_PB6MFP_Msk        /*!< ADC0_CH6        PB6      MFP Mask */
#define ADC0_CH7_PB7_Msk        SYS_GPB_MFPL_PB7MFP_Msk        /*!< ADC0_CH7        PB7      MFP Mask */
#define ADC0_CH8_PB8_Msk        SYS_GPB_MFPH_PB8MFP_Msk        /*!< ADC0_CH8        PB8      MFP Mask */
#define ADC0_CH9_PB9_Msk        SYS_GPB_MFPH_PB9MFP_Msk        /*!< ADC0_CH9        PB9      MFP Mask */
#define ADC0_ST_PF5_Msk         SYS_GPF_MFPL_PF5MFP_Msk        /*!< ADC0_ST         PF5      MFP Mask */
#define ADC0_ST_PC1_Msk         SYS_GPC_MFPL_PC1MFP_Msk        /*!< ADC0_ST         PC1      MFP Mask */
#define BPWM0_CH0_PA0_Msk       SYS_GPA_MFPL_PA0MFP_Msk        /*!< BPWM0_CH0       PA0      MFP Mask */
#define BPWM0_CH0_PA11_Msk      SYS_GPA_MFPH_PA11MFP_Msk       /*!< BPWM0_CH0       PA11     MFP Mask */
#define BPWM0_CH1_PA10_Msk      SYS_GPA_MFPH_PA10MFP_Msk       /*!< BPWM0_CH1       PA10     MFP Mask */
#define BPWM0_CH1_PA1_Msk       SYS_GPA_MFPL_PA1MFP_Msk        /*!< BPWM0_CH1       PA1      MFP Mask */
#define BPWM0_CH2_PA2_Msk       SYS_GPA_MFPL_PA2MFP_Msk        /*!< BPWM0_CH2       PA2      MFP Mask */
#define BPWM0_CH2_PA9_Msk       SYS_GPA_MFPH_PA9MFP_Msk        /*!< BPWM0_CH2       PA9      MFP Mask */
#define BPWM0_CH3_PA3_Msk       SYS_GPA_MFPL_PA3MFP_Msk        /*!< BPWM0_CH3       PA3      MFP Mask */
#define BPWM0_CH3_PF3_Msk       SYS_GPF_MFPL_PF3MFP_Msk        /*!< BPWM0_CH3       PF3      MFP Mask */
#define BPWM0_CH3_PA8_Msk       SYS_GPA_MFPH_PA8MFP_Msk        /*!< BPWM0_CH3       PA8      MFP Mask */
#define BPWM0_CH4_PA4_Msk       SYS_GPA_MFPL_PA4MFP_Msk        /*!< BPWM0_CH4       PA4      MFP Mask */
#define BPWM0_CH4_PF5_Msk       SYS_GPF_MFPL_PF5MFP_Msk        /*!< BPWM0_CH4       PF5      MFP Mask */
#define BPWM0_CH5_PA5_Msk       SYS_GPA_MFPL_PA5MFP_Msk        /*!< BPWM0_CH5       PA5      MFP Mask */
#define BPWM0_CH5_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< BPWM0_CH5       PF4      MFP Mask */
#define BPWM1_CH0_PB11_Msk      SYS_GPB_MFPH_PB11MFP_Msk       /*!< BPWM1_CH0       PB11     MFP Mask */
#define BPWM1_CH0_PF3_Msk       SYS_GPF_MFPL_PF3MFP_Msk        /*!< BPWM1_CH0       PF3      MFP Mask */
#define BPWM1_CH0_PC7_Msk       SYS_GPC_MFPL_PC7MFP_Msk        /*!< BPWM1_CH0       PC7      MFP Mask */
#define BPWM1_CH0_PF0_Msk       SYS_GPF_MFPL_PF0MFP_Msk        /*!< BPWM1_CH0       PF0      MFP Mask */
#define BPWM1_CH0_PF15_Msk      SYS_GPF_MFPH_PF15MFP_Msk       /*!< BPWM1_CH0       PF15     MFP Mask */
#define BPWM1_CH1_PC6_Msk       SYS_GPC_MFPL_PC6MFP_Msk        /*!< BPWM1_CH1       PC6      MFP Mask */
#define BPWM1_CH1_PF2_Msk       SYS_GPF_MFPL_PF2MFP_Msk        /*!< BPWM1_CH1       PF2      MFP Mask */
#define BPWM1_CH1_PB10_Msk      SYS_GPB_MFPH_PB10MFP_Msk       /*!< BPWM1_CH1       PB10     MFP Mask */
#define BPWM1_CH1_PF1_Msk       SYS_GPF_MFPL_PF1MFP_Msk        /*!< BPWM1_CH1       PF1      MFP Mask */
#define BPWM1_CH2_PA7_Msk       SYS_GPA_MFPL_PA7MFP_Msk        /*!< BPWM1_CH2       PA7      MFP Mask */
#define BPWM1_CH2_PB9_Msk       SYS_GPB_MFPH_PB9MFP_Msk        /*!< BPWM1_CH2       PB9      MFP Mask */
#define BPWM1_CH3_PA6_Msk       SYS_GPA_MFPL_PA6MFP_Msk        /*!< BPWM1_CH3       PA6      MFP Mask */
#define BPWM1_CH3_PB8_Msk       SYS_GPB_MFPH_PB8MFP_Msk        /*!< BPWM1_CH3       PB8      MFP Mask */
#define BPWM1_CH4_PB7_Msk       SYS_GPB_MFPL_PB7MFP_Msk        /*!< BPWM1_CH4       PB7      MFP Mask */
#define BPWM1_CH5_PB6_Msk       SYS_GPB_MFPL_PB6MFP_Msk        /*!< BPWM1_CH5       PB6      MFP Mask */
#define BPWM2_CH0_PA5_Msk       SYS_GPA_MFPL_PA5MFP_Msk        /*!< BPWM2_CH0       PA5      MFP Mask */
#define BPWM2_CH0_PF5_Msk       SYS_GPF_MFPL_PF5MFP_Msk        /*!< BPWM2_CH0       PF5      MFP Mask */
#define BPWM2_CH0_PB5_Msk       SYS_GPB_MFPL_PB5MFP_Msk        /*!< BPWM2_CH0       PB5      MFP Mask */
#define BPWM2_CH1_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< BPWM2_CH1       PF4      MFP Mask */
#define BPWM2_CH1_PA4_Msk       SYS_GPA_MFPL_PA4MFP_Msk        /*!< BPWM2_CH1       PA4      MFP Mask */
#define BPWM2_CH1_PB4_Msk       SYS_GPB_MFPL_PB4MFP_Msk        /*!< BPWM2_CH1       PB4      MFP Mask */
#define BPWM2_CH1_PC1_Msk       SYS_GPC_MFPL_PC1MFP_Msk        /*!< BPWM2_CH1       PC1      MFP Mask */
#define BPWM2_CH2_PA3_Msk       SYS_GPA_MFPL_PA3MFP_Msk        /*!< BPWM2_CH2       PA3      MFP Mask */
#define BPWM2_CH2_PB3_Msk       SYS_GPB_MFPL_PB3MFP_Msk        /*!< BPWM2_CH2       PB3      MFP Mask */
#define BPWM2_CH3_PA2_Msk       SYS_GPA_MFPL_PA2MFP_Msk        /*!< BPWM2_CH3       PA2      MFP Mask */
#define BPWM2_CH3_PB2_Msk       SYS_GPB_MFPL_PB2MFP_Msk        /*!< BPWM2_CH3       PB2      MFP Mask */
#define BPWM2_CH4_PB1_Msk       SYS_GPB_MFPL_PB1MFP_Msk        /*!< BPWM2_CH4       PB1      MFP Mask */
#define BPWM2_CH4_PF6_Msk       SYS_GPF_MFPL_PF6MFP_Msk        /*!< BPWM2_CH4       PF6      MFP Mask */
#define BPWM2_CH4_PF14_Msk      SYS_GPF_MFPH_PF14MFP_Msk       /*!< BPWM2_CH4       PF14     MFP Mask */
#define BPWM2_CH4_PA1_Msk       SYS_GPA_MFPL_PA1MFP_Msk        /*!< BPWM2_CH4       PA1      MFP Mask */
#define BPWM2_CH5_PD15_Msk      SYS_GPD_MFPH_PD15MFP_Msk       /*!< BPWM2_CH5       PD15     MFP Mask */
#define BPWM2_CH5_PA0_Msk       SYS_GPA_MFPL_PA0MFP_Msk        /*!< BPWM2_CH5       PA0      MFP Mask */
#define BPWM2_CH5_PB0_Msk       SYS_GPB_MFPL_PB0MFP_Msk        /*!< BPWM2_CH5       PB0      MFP Mask */
#define BPWM2_CH5_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< BPWM2_CH5       PF4      MFP Mask */
#define BPWM3_CH0_PC5_Msk       SYS_GPC_MFPL_PC5MFP_Msk        /*!< BPWM3_CH0       PC5      MFP Mask */
#define BPWM3_CH0_PB15_Msk      SYS_GPB_MFPH_PB15MFP_Msk       /*!< BPWM3_CH0       PB15     MFP Mask */
#define BPWM3_CH1_PB14_Msk      SYS_GPB_MFPH_PB14MFP_Msk       /*!< BPWM3_CH1       PB14     MFP Mask */
#define BPWM3_CH1_PC4_Msk       SYS_GPC_MFPL_PC4MFP_Msk        /*!< BPWM3_CH1       PC4      MFP Mask */
#define BPWM3_CH2_PB13_Msk      SYS_GPB_MFPH_PB13MFP_Msk       /*!< BPWM3_CH2       PB13     MFP Mask */
#define BPWM3_CH2_PC7_Msk       SYS_GPC_MFPL_PC7MFP_Msk        /*!< BPWM3_CH2       PC7      MFP Mask */
#define BPWM3_CH2_PC3_Msk       SYS_GPC_MFPL_PC3MFP_Msk        /*!< BPWM3_CH2       PC3      MFP Mask */
#define BPWM3_CH3_PB12_Msk      SYS_GPB_MFPH_PB12MFP_Msk       /*!< BPWM3_CH3       PB12     MFP Mask */
#define BPWM3_CH3_PC0_Msk       SYS_GPC_MFPL_PC0MFP_Msk        /*!< BPWM3_CH3       PC0      MFP Mask */
#define BPWM3_CH3_PC2_Msk       SYS_GPC_MFPL_PC2MFP_Msk        /*!< BPWM3_CH3       PC2      MFP Mask */
#define BPWM3_CH3_PC6_Msk       SYS_GPC_MFPL_PC6MFP_Msk        /*!< BPWM3_CH3       PC6      MFP Mask */
#define BPWM3_CH4_PC1_Msk       SYS_GPC_MFPL_PC1MFP_Msk        /*!< BPWM3_CH4       PC1      MFP Mask */
#define BPWM3_CH4_PA7_Msk       SYS_GPA_MFPL_PA7MFP_Msk        /*!< BPWM3_CH4       PA7      MFP Mask */
#define BPWM3_CH4_PB7_Msk       SYS_GPB_MFPL_PB7MFP_Msk        /*!< BPWM3_CH4       PB7      MFP Mask */
#define BPWM3_CH4_PB1_Msk       SYS_GPB_MFPL_PB1MFP_Msk        /*!< BPWM3_CH4       PB1      MFP Mask */
#define BPWM3_CH5_PB6_Msk       SYS_GPB_MFPL_PB6MFP_Msk        /*!< BPWM3_CH5       PB6      MFP Mask */
#define BPWM3_CH5_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< BPWM3_CH5       PF4      MFP Mask */
#define BPWM3_CH5_PC0_Msk       SYS_GPC_MFPL_PC0MFP_Msk        /*!< BPWM3_CH5       PC0      MFP Mask */
#define BPWM3_CH5_PA6_Msk       SYS_GPA_MFPL_PA6MFP_Msk        /*!< BPWM3_CH5       PA6      MFP Mask */
#define BPWM3_CH5_PB0_Msk       SYS_GPB_MFPL_PB0MFP_Msk        /*!< BPWM3_CH5       PB0      MFP Mask */
#define CLKO_PF6_Msk            SYS_GPF_MFPL_PF6MFP_Msk        /*!< CLKO            PF6      MFP Mask */
#define CLKO_PB14_Msk           SYS_GPB_MFPH_PB14MFP_Msk       /*!< CLKO            PB14     MFP Mask */
#define CLKO_PF14_Msk           SYS_GPF_MFPH_PF14MFP_Msk       /*!< CLKO            PF14     MFP Mask */
#define CLKO_PA3_Msk            SYS_GPA_MFPL_PA3MFP_Msk        /*!< CLKO            PA3      MFP Mask */
#define CLKO_PF15_Msk           SYS_GPF_MFPH_PF15MFP_Msk       /*!< CLKO            PF15     MFP Mask */
#define DAC0_OUT_PB12_Msk       SYS_GPB_MFPH_PB12MFP_Msk       /*!< DAC0_OUT        PB12     MFP Mask */
#define DAC0_ST_PA10_Msk        SYS_GPA_MFPH_PA10MFP_Msk       /*!< DAC0_ST         PA10     MFP Mask */
#define DAC0_ST_PA0_Msk         SYS_GPA_MFPL_PA0MFP_Msk        /*!< DAC0_ST         PA0      MFP Mask */
#define DAC1_OUT_PB13_Msk       SYS_GPB_MFPH_PB13MFP_Msk       /*!< DAC1_OUT        PB13     MFP Mask */
#define DAC1_ST_PC14_Msk        SYS_GPC_MFPH_PC14MFP_Msk       /*!< DAC1_ST         PC14     MFP Mask */
#define DAC1_ST_PA11_Msk        SYS_GPA_MFPH_PA11MFP_Msk       /*!< DAC1_ST         PA11     MFP Mask */
#define DAC2_OUT_PB14_Msk       SYS_GPB_MFPH_PB14MFP_Msk       /*!< DAC2_OUT        PB14     MFP Mask */
#define DAC2_ST_PA9_Msk         SYS_GPA_MFPH_PA9MFP_Msk        /*!< DAC2_ST         PA9      MFP Mask */
#define DAC2_ST_PA5_Msk         SYS_GPA_MFPL_PA5MFP_Msk        /*!< DAC2_ST         PA5      MFP Mask */
#define DAC3_OUT_PB15_Msk       SYS_GPB_MFPH_PB15MFP_Msk       /*!< DAC3_OUT        PB15     MFP Mask */
#define DAC3_ST_PA4_Msk         SYS_GPA_MFPL_PA4MFP_Msk        /*!< DAC3_ST         PA4      MFP Mask */
#define DAC3_ST_PA8_Msk         SYS_GPA_MFPH_PA8MFP_Msk        /*!< DAC3_ST         PA8      MFP Mask */
#define I2C0_SCL_PA8_Msk        SYS_GPA_MFPH_PA8MFP_Msk        /*!< I2C0_SCL        PA8      MFP Mask */
#define I2C0_SCL_PB5_Msk        SYS_GPB_MFPL_PB5MFP_Msk        /*!< I2C0_SCL        PB5      MFP Mask */
#define I2C0_SCL_PB9_Msk        SYS_GPB_MFPH_PB9MFP_Msk        /*!< I2C0_SCL        PB9      MFP Mask */
#define I2C0_SCL_PF3_Msk        SYS_GPF_MFPL_PF3MFP_Msk        /*!< I2C0_SCL        PF3      MFP Mask */
#define I2C0_SCL_PA5_Msk        SYS_GPA_MFPL_PA5MFP_Msk        /*!< I2C0_SCL        PA5      MFP Mask */
#define I2C0_SCL_PC1_Msk        SYS_GPC_MFPL_PC1MFP_Msk        /*!< I2C0_SCL        PC1      MFP Mask */
#define I2C0_SCL_PC3_Msk        SYS_GPC_MFPL_PC3MFP_Msk        /*!< I2C0_SCL        PC3      MFP Mask */
#define I2C0_SCL_PF5_Msk        SYS_GPF_MFPL_PF5MFP_Msk        /*!< I2C0_SCL        PF5      MFP Mask */
#define I2C0_SDA_PA4_Msk        SYS_GPA_MFPL_PA4MFP_Msk        /*!< I2C0_SDA        PA4      MFP Mask */
#define I2C0_SDA_PF6_Msk        SYS_GPF_MFPL_PF6MFP_Msk        /*!< I2C0_SDA        PF6      MFP Mask */
#define I2C0_SDA_PC0_Msk        SYS_GPC_MFPL_PC0MFP_Msk        /*!< I2C0_SDA        PC0      MFP Mask */
#define I2C0_SDA_PC2_Msk        SYS_GPC_MFPL_PC2MFP_Msk        /*!< I2C0_SDA        PC2      MFP Mask */
#define I2C0_SDA_PF2_Msk        SYS_GPF_MFPL_PF2MFP_Msk        /*!< I2C0_SDA        PF2      MFP Mask */
#define I2C0_SDA_PB8_Msk        SYS_GPB_MFPH_PB8MFP_Msk        /*!< I2C0_SDA        PB8      MFP Mask */
#define I2C0_SDA_PB4_Msk        SYS_GPB_MFPL_PB4MFP_Msk        /*!< I2C0_SDA        PB4      MFP Mask */
#define I2C0_SDA_PF4_Msk        SYS_GPF_MFPL_PF4MFP_Msk        /*!< I2C0_SDA        PF4      MFP Mask */
#define I2C0_SMBAL_PC3_Msk      SYS_GPC_MFPL_PC3MFP_Msk        /*!< I2C0_SMBAL      PC3      MFP Mask */
#define I2C0_SMBAL_PA3_Msk      SYS_GPA_MFPL_PA3MFP_Msk        /*!< I2C0_SMBAL      PA3      MFP Mask */
#define I2C0_SMBSUS_PA2_Msk     SYS_GPA_MFPL_PA2MFP_Msk        /*!< I2C0_SMBSUS     PA2      MFP Mask */
#define I2C0_SMBSUS_PC2_Msk     SYS_GPC_MFPL_PC2MFP_Msk        /*!< I2C0_SMBSUS     PC2      MFP Mask */
#define I2C1_SCL_PC1_Msk        SYS_GPC_MFPL_PC1MFP_Msk        /*!< I2C1_SCL        PC1      MFP Mask */
#define I2C1_SCL_PA10_Msk       SYS_GPA_MFPH_PA10MFP_Msk       /*!< I2C1_SCL        PA10     MFP Mask */
#define I2C1_SCL_PA7_Msk        SYS_GPA_MFPL_PA7MFP_Msk        /*!< I2C1_SCL        PA7      MFP Mask */
#define I2C1_SCL_PA3_Msk        SYS_GPA_MFPL_PA3MFP_Msk        /*!< I2C1_SCL        PA3      MFP Mask */
#define I2C1_SCL_PB11_Msk       SYS_GPB_MFPH_PB11MFP_Msk       /*!< I2C1_SCL        PB11     MFP Mask */
#define I2C1_SCL_PB1_Msk        SYS_GPB_MFPL_PB1MFP_Msk        /*!< I2C1_SCL        PB1      MFP Mask */
#define I2C1_SCL_PF0_Msk        SYS_GPF_MFPL_PF0MFP_Msk        /*!< I2C1_SCL        PF0      MFP Mask */
#define I2C1_SCL_PC5_Msk        SYS_GPC_MFPL_PC5MFP_Msk        /*!< I2C1_SCL        PC5      MFP Mask */
#define I2C1_SCL_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< I2C1_SCL        PB3      MFP Mask */
#define I2C1_SDA_PC0_Msk        SYS_GPC_MFPL_PC0MFP_Msk        /*!< I2C1_SDA        PC0      MFP Mask */
#define I2C1_SDA_PB0_Msk        SYS_GPB_MFPL_PB0MFP_Msk        /*!< I2C1_SDA        PB0      MFP Mask */
#define I2C1_SDA_PA2_Msk        SYS_GPA_MFPL_PA2MFP_Msk        /*!< I2C1_SDA        PA2      MFP Mask */
#define I2C1_SDA_PC4_Msk        SYS_GPC_MFPL_PC4MFP_Msk        /*!< I2C1_SDA        PC4      MFP Mask */
#define I2C1_SDA_PB2_Msk        SYS_GPB_MFPL_PB2MFP_Msk        /*!< I2C1_SDA        PB2      MFP Mask */
#define I2C1_SDA_PA9_Msk        SYS_GPA_MFPH_PA9MFP_Msk        /*!< I2C1_SDA        PA9      MFP Mask */
#define I2C1_SDA_PB10_Msk       SYS_GPB_MFPH_PB10MFP_Msk       /*!< I2C1_SDA        PB10     MFP Mask */
#define I2C1_SDA_PA6_Msk        SYS_GPA_MFPL_PA6MFP_Msk        /*!< I2C1_SDA        PA6      MFP Mask */
#define I2C1_SDA_PF1_Msk        SYS_GPF_MFPL_PF1MFP_Msk        /*!< I2C1_SDA        PF1      MFP Mask */
#define I2C1_SMBAL_PC7_Msk      SYS_GPC_MFPL_PC7MFP_Msk        /*!< I2C1_SMBAL      PC7      MFP Mask */
#define I2C1_SMBAL_PB9_Msk      SYS_GPB_MFPH_PB9MFP_Msk        /*!< I2C1_SMBAL      PB9      MFP Mask */
#define I2C1_SMBAL_PF0_Msk      SYS_GPF_MFPL_PF0MFP_Msk        /*!< I2C1_SMBAL      PF0      MFP Mask */
#define I2C1_SMBSUS_PB8_Msk     SYS_GPB_MFPH_PB8MFP_Msk        /*!< I2C1_SMBSUS     PB8      MFP Mask */
#define I2C1_SMBSUS_PC6_Msk     SYS_GPC_MFPL_PC6MFP_Msk        /*!< I2C1_SMBSUS     PC6      MFP Mask */
#define I2C1_SMBSUS_PF1_Msk     SYS_GPF_MFPL_PF1MFP_Msk        /*!< I2C1_SMBSUS     PF1      MFP Mask */
#define I2C2_SCL_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< I2C2_SCL        PB3      MFP Mask */
#define I2C2_SCL_PA11_Msk       SYS_GPA_MFPH_PA11MFP_Msk       /*!< I2C2_SCL        PA11     MFP Mask */
#define I2C2_SCL_PF0_Msk        SYS_GPF_MFPL_PF0MFP_Msk        /*!< I2C2_SCL        PF0      MFP Mask */
#define I2C2_SCL_PA1_Msk        SYS_GPA_MFPL_PA1MFP_Msk        /*!< I2C2_SCL        PA1      MFP Mask */
#define I2C2_SCL_PB13_Msk       SYS_GPB_MFPH_PB13MFP_Msk       /*!< I2C2_SCL        PB13     MFP Mask */
#define I2C2_SDA_PA0_Msk        SYS_GPA_MFPL_PA0MFP_Msk        /*!< I2C2_SDA        PA0      MFP Mask */
#define I2C2_SDA_PF1_Msk        SYS_GPF_MFPL_PF1MFP_Msk        /*!< I2C2_SDA        PF1      MFP Mask */
#define I2C2_SDA_PA10_Msk       SYS_GPA_MFPH_PA10MFP_Msk       /*!< I2C2_SDA        PA10     MFP Mask */
#define I2C2_SDA_PB2_Msk        SYS_GPB_MFPL_PB2MFP_Msk        /*!< I2C2_SDA        PB2      MFP Mask */
#define I2C2_SDA_PB12_Msk       SYS_GPB_MFPH_PB12MFP_Msk       /*!< I2C2_SDA        PB12     MFP Mask */
#define I2C2_SMBAL_PB15_Msk     SYS_GPB_MFPH_PB15MFP_Msk       /*!< I2C2_SMBAL      PB15     MFP Mask */
#define I2C2_SMBAL_PC3_Msk      SYS_GPC_MFPL_PC3MFP_Msk        /*!< I2C2_SMBAL      PC3      MFP Mask */
#define I2C2_SMBSUS_PB14_Msk    SYS_GPB_MFPH_PB14MFP_Msk       /*!< I2C2_SMBSUS     PB14     MFP Mask */
#define I2C2_SMBSUS_PC2_Msk     SYS_GPC_MFPL_PC2MFP_Msk        /*!< I2C2_SMBSUS     PC2      MFP Mask */
#define I3C0_SCL_PA5_Msk        SYS_GPA_MFPL_PA5MFP_Msk        /*!< I3C0_SCL        PA5      MFP Mask */
#define I3C0_SCL_PA1_Msk        SYS_GPA_MFPL_PA1MFP_Msk        /*!< I3C0_SCL        PA1      MFP Mask */
#define I3C0_SDA_PA0_Msk        SYS_GPA_MFPL_PA0MFP_Msk        /*!< I3C0_SDA        PA0      MFP Mask */
#define I3C0_SDA_PA4_Msk        SYS_GPA_MFPL_PA4MFP_Msk        /*!< I3C0_SDA        PA4      MFP Mask */
#define I3C1_SCL_PA3_Msk        SYS_GPA_MFPL_PA3MFP_Msk        /*!< I3C1_SCL        PA3      MFP Mask */
#define I3C1_SDA_PA2_Msk        SYS_GPA_MFPL_PA2MFP_Msk        /*!< I3C1_SDA        PA2      MFP Mask */
#define ICE_CLK_PF1_Msk         SYS_GPF_MFPL_PF1MFP_Msk        /*!< ICE_CLK         PF1      MFP Mask */
#define ICE_DAT_PF0_Msk         SYS_GPF_MFPL_PF0MFP_Msk        /*!< ICE_DAT         PF0      MFP Mask */
#define INT0_PA6_Msk            SYS_GPA_MFPL_PA6MFP_Msk        /*!< INT0            PA6      MFP Mask */
#define INT0_PB5_Msk            SYS_GPB_MFPL_PB5MFP_Msk        /*!< INT0            PB5      MFP Mask */
#define INT1_PB4_Msk            SYS_GPB_MFPL_PB4MFP_Msk        /*!< INT1            PB4      MFP Mask */
#define INT1_PD15_Msk           SYS_GPD_MFPH_PD15MFP_Msk       /*!< INT1            PD15     MFP Mask */
#define INT1_PA7_Msk            SYS_GPA_MFPL_PA7MFP_Msk        /*!< INT1            PA7      MFP Mask */
#define INT2_PC6_Msk            SYS_GPC_MFPL_PC6MFP_Msk        /*!< INT2            PC6      MFP Mask */
#define INT2_PB3_Msk            SYS_GPB_MFPL_PB3MFP_Msk        /*!< INT2            PB3      MFP Mask */
#define INT3_PB2_Msk            SYS_GPB_MFPL_PB2MFP_Msk        /*!< INT3            PB2      MFP Mask */
#define INT3_PC7_Msk            SYS_GPC_MFPL_PC7MFP_Msk        /*!< INT3            PC7      MFP Mask */
#define INT4_PB6_Msk            SYS_GPB_MFPL_PB6MFP_Msk        /*!< INT4            PB6      MFP Mask */
#define INT4_PF2_Msk            SYS_GPF_MFPL_PF2MFP_Msk        /*!< INT4            PF2      MFP Mask */
#define INT4_PA8_Msk            SYS_GPA_MFPH_PA8MFP_Msk        /*!< INT4            PA8      MFP Mask */
#define INT4_PF15_Msk           SYS_GPF_MFPH_PF15MFP_Msk       /*!< INT4            PF15     MFP Mask */
#define INT5_PB7_Msk            SYS_GPB_MFPL_PB7MFP_Msk        /*!< INT5            PB7      MFP Mask */
#define INT5_PF6_Msk            SYS_GPF_MFPL_PF6MFP_Msk        /*!< INT5            PF6      MFP Mask */
#define INT5_PF14_Msk           SYS_GPF_MFPH_PF14MFP_Msk       /*!< INT5            PF14     MFP Mask */
#define LLSI0_OUT_PB15_Msk      SYS_GPB_MFPH_PB15MFP_Msk       /*!< LLSI0_OUT       PB15     MFP Mask */
#define LLSI0_OUT_PC5_Msk       SYS_GPC_MFPL_PC5MFP_Msk        /*!< LLSI0_OUT       PC5      MFP Mask */
#define LLSI1_OUT_PC4_Msk       SYS_GPC_MFPL_PC4MFP_Msk        /*!< LLSI1_OUT       PC4      MFP Mask */
#define LLSI1_OUT_PB14_Msk      SYS_GPB_MFPH_PB14MFP_Msk       /*!< LLSI1_OUT       PB14     MFP Mask */
#define LLSI2_OUT_PB13_Msk      SYS_GPB_MFPH_PB13MFP_Msk       /*!< LLSI2_OUT       PB13     MFP Mask */
