OpenNuvoton/NuTool-PinConfigure/Header/NUC1263/sys.h
#define LLSI2_OUT_PC3_Msk       SYS_GPC_MFPL_PC3MFP_Msk        /*!< LLSI2_OUT       PC3      MFP Mask */
#define LLSI3_OUT_PF6_Msk       SYS_GPF_MFPL_PF6MFP_Msk        /*!< LLSI3_OUT       PF6      MFP Mask */
#define LLSI3_OUT_PF14_Msk      SYS_GPF_MFPH_PF14MFP_Msk       /*!< LLSI3_OUT       PF14     MFP Mask */
#define LLSI3_OUT_PB12_Msk      SYS_GPB_MFPH_PB12MFP_Msk       /*!< LLSI3_OUT       PB12     MFP Mask */
#define LLSI3_OUT_PC2_Msk       SYS_GPC_MFPL_PC2MFP_Msk        /*!< LLSI3_OUT       PC2      MFP Mask */
#define LLSI4_OUT_PA3_Msk       SYS_GPA_MFPL_PA3MFP_Msk        /*!< LLSI4_OUT       PA3      MFP Mask */
#define LLSI4_OUT_PB5_Msk       SYS_GPB_MFPL_PB5MFP_Msk        /*!< LLSI4_OUT       PB5      MFP Mask */
#define LLSI5_OUT_PA2_Msk       SYS_GPA_MFPL_PA2MFP_Msk        /*!< LLSI5_OUT       PA2      MFP Mask */
#define LLSI5_OUT_PB4_Msk       SYS_GPB_MFPL_PB4MFP_Msk        /*!< LLSI5_OUT       PB4      MFP Mask */
#define SPDH_HSA_PB1_Msk        SYS_GPB_MFPL_PB1MFP_Msk        /*!< SPDH_HSA        PB1      MFP Mask */
#define SPI0_CLK_PD2_Msk        SYS_GPD_MFPL_PD2MFP_Msk        /*!< SPI0_CLK        PD2      MFP Mask */
#define SPI0_CLK_PB14_Msk       SYS_GPB_MFPH_PB14MFP_Msk       /*!< SPI0_CLK        PB14     MFP Mask */
#define SPI0_CLK_PF5_Msk        SYS_GPF_MFPL_PF5MFP_Msk        /*!< SPI0_CLK        PF5      MFP Mask */
#define SPI0_CLK_PA2_Msk        SYS_GPA_MFPL_PA2MFP_Msk        /*!< SPI0_CLK        PA2      MFP Mask */
#define SPI0_I2SMCLK_PA4_Msk    SYS_GPA_MFPL_PA4MFP_Msk        /*!< SPI0_I2SMCLK    PA4      MFP Mask */
#define SPI0_I2SMCLK_PA5_Msk    SYS_GPA_MFPL_PA5MFP_Msk        /*!< SPI0_I2SMCLK    PA5      MFP Mask */
#define SPI0_I2SMCLK_PB0_Msk    SYS_GPB_MFPL_PB0MFP_Msk        /*!< SPI0_I2SMCLK    PB0      MFP Mask */
#define SPI0_I2SMCLK_PB11_Msk   SYS_GPB_MFPH_PB11MFP_Msk       /*!< SPI0_I2SMCLK    PB11     MFP Mask */
#define SPI0_I2SMCLK_PB2_Msk    SYS_GPB_MFPL_PB2MFP_Msk        /*!< SPI0_I2SMCLK    PB2      MFP Mask */
#define SPI0_I2SMCLK_PC14_Msk   SYS_GPC_MFPH_PC14MFP_Msk       /*!< SPI0_I2SMCLK    PC14     MFP Mask */
#define SPI0_MISO_PD1_Msk       SYS_GPD_MFPL_PD1MFP_Msk        /*!< SPI0_MISO       PD1      MFP Mask */
#define SPI0_MISO_PA1_Msk       SYS_GPA_MFPL_PA1MFP_Msk        /*!< SPI0_MISO       PA1      MFP Mask */
#define SPI0_MISO_PB13_Msk      SYS_GPB_MFPH_PB13MFP_Msk       /*!< SPI0_MISO       PB13     MFP Mask */
#define SPI0_MISO_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< SPI0_MISO       PF4      MFP Mask */
#define SPI0_MOSI_PB12_Msk      SYS_GPB_MFPH_PB12MFP_Msk       /*!< SPI0_MOSI       PB12     MFP Mask */
#define SPI0_MOSI_PD0_Msk       SYS_GPD_MFPL_PD0MFP_Msk        /*!< SPI0_MOSI       PD0      MFP Mask */
#define SPI0_MOSI_PA0_Msk       SYS_GPA_MFPL_PA0MFP_Msk        /*!< SPI0_MOSI       PA0      MFP Mask */
#define SPI0_MOSI_PF6_Msk       SYS_GPF_MFPL_PF6MFP_Msk        /*!< SPI0_MOSI       PF6      MFP Mask */
#define SPI0_SS_PD3_Msk         SYS_GPD_MFPL_PD3MFP_Msk        /*!< SPI0_SS         PD3      MFP Mask */
#define SPI0_SS_PB0_Msk         SYS_GPB_MFPL_PB0MFP_Msk        /*!< SPI0_SS         PB0      MFP Mask */
#define SPI0_SS_PF14_Msk        SYS_GPF_MFPH_PF14MFP_Msk       /*!< SPI0_SS         PF14     MFP Mask */
#define SPI0_SS_PB15_Msk        SYS_GPB_MFPH_PB15MFP_Msk       /*!< SPI0_SS         PB15     MFP Mask */
#define SPI0_SS_PA3_Msk         SYS_GPA_MFPL_PA3MFP_Msk        /*!< SPI0_SS         PA3      MFP Mask */
#define SPI1_CLK_PA9_Msk        SYS_GPA_MFPH_PA9MFP_Msk        /*!< SPI1_CLK        PA9      MFP Mask */
#define SPI1_CLK_PA7_Msk        SYS_GPA_MFPL_PA7MFP_Msk        /*!< SPI1_CLK        PA7      MFP Mask */
#define SPI1_CLK_PC1_Msk        SYS_GPC_MFPL_PC1MFP_Msk        /*!< SPI1_CLK        PC1      MFP Mask */
#define SPI1_CLK_PB3_Msk        SYS_GPB_MFPL_PB3MFP_Msk        /*!< SPI1_CLK        PB3      MFP Mask */
#define SPI1_I2SMCLK_PB1_Msk    SYS_GPB_MFPL_PB1MFP_Msk        /*!< SPI1_I2SMCLK    PB1      MFP Mask */
#define SPI1_I2SMCLK_PA5_Msk    SYS_GPA_MFPL_PA5MFP_Msk        /*!< SPI1_I2SMCLK    PA5      MFP Mask */
#define SPI1_I2SMCLK_PC4_Msk    SYS_GPC_MFPL_PC4MFP_Msk        /*!< SPI1_I2SMCLK    PC4      MFP Mask */
#define SPI1_MISO_PC7_Msk       SYS_GPC_MFPL_PC7MFP_Msk        /*!< SPI1_MISO       PC7      MFP Mask */
#define SPI1_MISO_PB5_Msk       SYS_GPB_MFPL_PB5MFP_Msk        /*!< SPI1_MISO       PB5      MFP Mask */
#define SPI1_MISO_PC3_Msk       SYS_GPC_MFPL_PC3MFP_Msk        /*!< SPI1_MISO       PC3      MFP Mask */
#define SPI1_MISO_PA10_Msk      SYS_GPA_MFPH_PA10MFP_Msk       /*!< SPI1_MISO       PA10     MFP Mask */
#define SPI1_MOSI_PB4_Msk       SYS_GPB_MFPL_PB4MFP_Msk        /*!< SPI1_MOSI       PB4      MFP Mask */
#define SPI1_MOSI_PC2_Msk       SYS_GPC_MFPL_PC2MFP_Msk        /*!< SPI1_MOSI       PC2      MFP Mask */
#define SPI1_MOSI_PC6_Msk       SYS_GPC_MFPL_PC6MFP_Msk        /*!< SPI1_MOSI       PC6      MFP Mask */
#define SPI1_MOSI_PA11_Msk      SYS_GPA_MFPH_PA11MFP_Msk       /*!< SPI1_MOSI       PA11     MFP Mask */
#define SPI1_MOSI_PC14_Msk      SYS_GPC_MFPH_PC14MFP_Msk       /*!< SPI1_MOSI       PC14     MFP Mask */
#define SPI1_SS_PA8_Msk         SYS_GPA_MFPH_PA8MFP_Msk        /*!< SPI1_SS         PA8      MFP Mask */
#define SPI1_SS_PA6_Msk         SYS_GPA_MFPL_PA6MFP_Msk        /*!< SPI1_SS         PA6      MFP Mask */
#define SPI1_SS_PC0_Msk         SYS_GPC_MFPL_PC0MFP_Msk        /*!< SPI1_SS         PC0      MFP Mask */
#define SPI1_SS_PB2_Msk         SYS_GPB_MFPL_PB2MFP_Msk        /*!< SPI1_SS         PB2      MFP Mask */
#define SPI1_SS_PF5_Msk         SYS_GPF_MFPL_PF5MFP_Msk        /*!< SPI1_SS         PF5      MFP Mask */
#define SPI2_CLK_PA2_Msk        SYS_GPA_MFPL_PA2MFP_Msk        /*!< SPI2_CLK        PA2      MFP Mask */
#define SPI2_CLK_PA10_Msk       SYS_GPA_MFPH_PA10MFP_Msk       /*!< SPI2_CLK        PA10     MFP Mask */
#define SPI2_I2SMCLK_PA5_Msk    SYS_GPA_MFPL_PA5MFP_Msk        /*!< SPI2_I2SMCLK    PA5      MFP Mask */
#define SPI2_I2SMCLK_PB0_Msk    SYS_GPB_MFPL_PB0MFP_Msk        /*!< SPI2_I2SMCLK    PB0      MFP Mask */
#define SPI2_MISO_PA1_Msk       SYS_GPA_MFPL_PA1MFP_Msk        /*!< SPI2_MISO       PA1      MFP Mask */
#define SPI2_MISO_PA9_Msk       SYS_GPA_MFPH_PA9MFP_Msk        /*!< SPI2_MISO       PA9      MFP Mask */
#define SPI2_MOSI_PA0_Msk       SYS_GPA_MFPL_PA0MFP_Msk        /*!< SPI2_MOSI       PA0      MFP Mask */
#define SPI2_MOSI_PA8_Msk       SYS_GPA_MFPH_PA8MFP_Msk        /*!< SPI2_MOSI       PA8      MFP Mask */
#define SPI2_SS_PA3_Msk         SYS_GPA_MFPL_PA3MFP_Msk        /*!< SPI2_SS         PA3      MFP Mask */
#define SPI2_SS_PA11_Msk        SYS_GPA_MFPH_PA11MFP_Msk       /*!< SPI2_SS         PA11     MFP Mask */
#define SPI_CLK_MUX_PA2_Msk     SYS_GPA_MFPL_PA2MFP_Msk        /*!< SPI_CLK_MUX     PA2      MFP Mask */
#define SPI_MISO_MUX_PA1_Msk    SYS_GPA_MFPL_PA1MFP_Msk        /*!< SPI_MISO_MUX    PA1      MFP Mask */
#define SPI_MOSI_MUX_PA0_Msk    SYS_GPA_MFPL_PA0MFP_Msk        /*!< SPI_MOSI_MUX    PA0      MFP Mask */
#define SPI_SS_MUX_PA3_Msk      SYS_GPA_MFPL_PA3MFP_Msk        /*!< SPI_SS_MUX      PA3      MFP Mask */
#define TM0_PB5_Msk             SYS_GPB_MFPL_PB5MFP_Msk        /*!< TM0             PB5      MFP Mask */
#define TM0_PC7_Msk             SYS_GPC_MFPL_PC7MFP_Msk        /*!< TM0             PC7      MFP Mask */
#define TM0_EXT_PA11_Msk        SYS_GPA_MFPH_PA11MFP_Msk       /*!< TM0_EXT         PA11     MFP Mask */
#define TM0_EXT_PB15_Msk        SYS_GPB_MFPH_PB15MFP_Msk       /*!< TM0_EXT         PB15     MFP Mask */
#define TM1_PB4_Msk             SYS_GPB_MFPL_PB4MFP_Msk        /*!< TM1             PB4      MFP Mask */
#define TM1_PC14_Msk            SYS_GPC_MFPH_PC14MFP_Msk       /*!< TM1             PC14     MFP Mask */
#define TM1_PC6_Msk             SYS_GPC_MFPL_PC6MFP_Msk        /*!< TM1             PC6      MFP Mask */
#define TM1_EXT_PA10_Msk        SYS_GPA_MFPH_PA10MFP_Msk       /*!< TM1_EXT         PA10     MFP Mask */
#define TM1_EXT_PB14_Msk        SYS_GPB_MFPH_PB14MFP_Msk       /*!< TM1_EXT         PB14     MFP Mask */
#define TM2_PD0_Msk             SYS_GPD_MFPL_PD0MFP_Msk        /*!< TM2             PD0      MFP Mask */
#define TM2_PF15_Msk            SYS_GPF_MFPH_PF15MFP_Msk       /*!< TM2             PF15     MFP Mask */
#define TM2_PB3_Msk             SYS_GPB_MFPL_PB3MFP_Msk        /*!< TM2             PB3      MFP Mask */
#define TM2_PA7_Msk             SYS_GPA_MFPL_PA7MFP_Msk        /*!< TM2             PA7      MFP Mask */
#define TM2_EXT_PB13_Msk        SYS_GPB_MFPH_PB13MFP_Msk       /*!< TM2_EXT         PB13     MFP Mask */
#define TM2_EXT_PA9_Msk         SYS_GPA_MFPH_PA9MFP_Msk        /*!< TM2_EXT         PA9      MFP Mask */
#define TM3_PD15_Msk            SYS_GPD_MFPH_PD15MFP_Msk       /*!< TM3             PD15     MFP Mask */
#define TM3_PA6_Msk             SYS_GPA_MFPL_PA6MFP_Msk        /*!< TM3             PA6      MFP Mask */
#define TM3_PF6_Msk             SYS_GPF_MFPL_PF6MFP_Msk        /*!< TM3             PF6      MFP Mask */
#define TM3_PB2_Msk             SYS_GPB_MFPL_PB2MFP_Msk        /*!< TM3             PB2      MFP Mask */
#define TM3_PF14_Msk            SYS_GPF_MFPH_PF14MFP_Msk       /*!< TM3             PF14     MFP Mask */
#define TM3_EXT_PA8_Msk         SYS_GPA_MFPH_PA8MFP_Msk        /*!< TM3_EXT         PA8      MFP Mask */
#define TM3_EXT_PB1_Msk         SYS_GPB_MFPL_PB1MFP_Msk        /*!< TM3_EXT         PB1      MFP Mask */
#define TM3_EXT_PB12_Msk        SYS_GPB_MFPH_PB12MFP_Msk       /*!< TM3_EXT         PB12     MFP Mask */
#define UART0_RXD_PF2_Msk       SYS_GPF_MFPL_PF2MFP_Msk        /*!< UART0_RXD       PF2      MFP Mask */
#define UART0_RXD_PA6_Msk       SYS_GPA_MFPL_PA6MFP_Msk        /*!< UART0_RXD       PA6      MFP Mask */
#define UART0_RXD_PF1_Msk       SYS_GPF_MFPL_PF1MFP_Msk        /*!< UART0_RXD       PF1      MFP Mask */
#define UART0_RXD_PD2_Msk       SYS_GPD_MFPL_PD2MFP_Msk        /*!< UART0_RXD       PD2      MFP Mask */
#define UART0_RXD_PB12_Msk      SYS_GPB_MFPH_PB12MFP_Msk       /*!< UART0_RXD       PB12     MFP Mask */
#define UART0_RXD_PB8_Msk       SYS_GPB_MFPH_PB8MFP_Msk        /*!< UART0_RXD       PB8      MFP Mask */
#define UART0_RXD_PA4_Msk       SYS_GPA_MFPL_PA4MFP_Msk        /*!< UART0_RXD       PA4      MFP Mask */
#define UART0_RXD_PA0_Msk       SYS_GPA_MFPL_PA0MFP_Msk        /*!< UART0_RXD       PA0      MFP Mask */
#define UART0_TXD_PF0_Msk       SYS_GPF_MFPL_PF0MFP_Msk        /*!< UART0_TXD       PF0      MFP Mask */
#define UART0_TXD_PA5_Msk       SYS_GPA_MFPL_PA5MFP_Msk        /*!< UART0_TXD       PA5      MFP Mask */
#define UART0_TXD_PD3_Msk       SYS_GPD_MFPL_PD3MFP_Msk        /*!< UART0_TXD       PD3      MFP Mask */
#define UART0_TXD_PB9_Msk       SYS_GPB_MFPH_PB9MFP_Msk        /*!< UART0_TXD       PB9      MFP Mask */
#define UART0_TXD_PF3_Msk       SYS_GPF_MFPL_PF3MFP_Msk        /*!< UART0_TXD       PF3      MFP Mask */
#define UART0_TXD_PA1_Msk       SYS_GPA_MFPL_PA1MFP_Msk        /*!< UART0_TXD       PA1      MFP Mask */
#define UART0_TXD_PB13_Msk      SYS_GPB_MFPH_PB13MFP_Msk       /*!< UART0_TXD       PB13     MFP Mask */
#define UART0_TXD_PA7_Msk       SYS_GPA_MFPL_PA7MFP_Msk        /*!< UART0_TXD       PA7      MFP Mask */
#define UART0_nCTS_PA5_Msk      SYS_GPA_MFPL_PA5MFP_Msk        /*!< UART0_nCTS      PA5      MFP Mask */
#define UART0_nCTS_PC7_Msk      SYS_GPC_MFPL_PC7MFP_Msk        /*!< UART0_nCTS      PC7      MFP Mask */
#define UART0_nCTS_PB11_Msk     SYS_GPB_MFPH_PB11MFP_Msk       /*!< UART0_nCTS      PB11     MFP Mask */
#define UART0_nCTS_PB15_Msk     SYS_GPB_MFPH_PB15MFP_Msk       /*!< UART0_nCTS      PB15     MFP Mask */
#define UART0_nRTS_PF15_Msk     SYS_GPF_MFPH_PF15MFP_Msk       /*!< UART0_nRTS      PF15     MFP Mask */
#define UART0_nRTS_PB10_Msk     SYS_GPB_MFPH_PB10MFP_Msk       /*!< UART0_nRTS      PB10     MFP Mask */
#define UART0_nRTS_PB14_Msk     SYS_GPB_MFPH_PB14MFP_Msk       /*!< UART0_nRTS      PB14     MFP Mask */
#define UART0_nRTS_PC6_Msk      SYS_GPC_MFPL_PC6MFP_Msk        /*!< UART0_nRTS      PC6      MFP Mask */
#define UART0_nRTS_PA4_Msk      SYS_GPA_MFPL_PA4MFP_Msk        /*!< UART0_nRTS      PA4      MFP Mask */
#define UART1_RXD_PA8_Msk       SYS_GPA_MFPH_PA8MFP_Msk        /*!< UART1_RXD       PA8      MFP Mask */
#define UART1_RXD_PF2_Msk       SYS_GPF_MFPL_PF2MFP_Msk        /*!< UART1_RXD       PF2      MFP Mask */
#define UART1_RXD_PF1_Msk       SYS_GPF_MFPL_PF1MFP_Msk        /*!< UART1_RXD       PF1      MFP Mask */
#define UART1_RXD_PB2_Msk       SYS_GPB_MFPL_PB2MFP_Msk        /*!< UART1_RXD       PB2      MFP Mask */
#define UART1_RXD_PA2_Msk       SYS_GPA_MFPL_PA2MFP_Msk        /*!< UART1_RXD       PA2      MFP Mask */
#define UART1_RXD_PB6_Msk       SYS_GPB_MFPL_PB6MFP_Msk        /*!< UART1_RXD       PB6      MFP Mask */
#define UART1_TXD_PB7_Msk       SYS_GPB_MFPL_PB7MFP_Msk        /*!< UART1_TXD       PB7      MFP Mask */
#define UART1_TXD_PF0_Msk       SYS_GPF_MFPL_PF0MFP_Msk        /*!< UART1_TXD       PF0      MFP Mask */
#define UART1_TXD_PA9_Msk       SYS_GPA_MFPH_PA9MFP_Msk        /*!< UART1_TXD       PA9      MFP Mask */
#define UART1_TXD_PB3_Msk       SYS_GPB_MFPL_PB3MFP_Msk        /*!< UART1_TXD       PB3      MFP Mask */
#define UART1_TXD_PA3_Msk       SYS_GPA_MFPL_PA3MFP_Msk        /*!< UART1_TXD       PA3      MFP Mask */
#define UART1_nCTS_PA1_Msk      SYS_GPA_MFPL_PA1MFP_Msk        /*!< UART1_nCTS      PA1      MFP Mask */
#define UART1_nCTS_PB9_Msk      SYS_GPB_MFPH_PB9MFP_Msk        /*!< UART1_nCTS      PB9      MFP Mask */
#define UART1_nRTS_PA0_Msk      SYS_GPA_MFPL_PA0MFP_Msk        /*!< UART1_nRTS      PA0      MFP Mask */
#define UART1_nRTS_PB8_Msk      SYS_GPB_MFPH_PB8MFP_Msk        /*!< UART1_nRTS      PB8      MFP Mask */
#define UART2_RXD_PF1_Msk       SYS_GPF_MFPL_PF1MFP_Msk        /*!< UART2_RXD       PF1      MFP Mask */
#define UART2_RXD_PC0_Msk       SYS_GPC_MFPL_PC0MFP_Msk        /*!< UART2_RXD       PC0      MFP Mask */
#define UART2_RXD_PF5_Msk       SYS_GPF_MFPL_PF5MFP_Msk        /*!< UART2_RXD       PF5      MFP Mask */
#define UART2_RXD_PC4_Msk       SYS_GPC_MFPL_PC4MFP_Msk        /*!< UART2_RXD       PC4      MFP Mask */
#define UART2_RXD_PF3_Msk       SYS_GPF_MFPL_PF3MFP_Msk        /*!< UART2_RXD       PF3      MFP Mask */
#define UART2_RXD_PB4_Msk       SYS_GPB_MFPL_PB4MFP_Msk        /*!< UART2_RXD       PB4      MFP Mask */
#define UART2_RXD_PB0_Msk       SYS_GPB_MFPL_PB0MFP_Msk        /*!< UART2_RXD       PB0      MFP Mask */
#define UART2_TXD_PB1_Msk       SYS_GPB_MFPL_PB1MFP_Msk        /*!< UART2_TXD       PB1      MFP Mask */
#define UART2_TXD_PF0_Msk       SYS_GPF_MFPL_PF0MFP_Msk        /*!< UART2_TXD       PF0      MFP Mask */
#define UART2_TXD_PF4_Msk       SYS_GPF_MFPL_PF4MFP_Msk        /*!< UART2_TXD       PF4      MFP Mask */
#define UART2_TXD_PC5_Msk       SYS_GPC_MFPL_PC5MFP_Msk        /*!< UART2_TXD       PC5      MFP Mask */
#define UART2_TXD_PB5_Msk       SYS_GPB_MFPL_PB5MFP_Msk        /*!< UART2_TXD       PB5      MFP Mask */
#define UART2_TXD_PC1_Msk       SYS_GPC_MFPL_PC1MFP_Msk        /*!< UART2_TXD       PC1      MFP Mask */
#define UART2_nCTS_PC2_Msk      SYS_GPC_MFPL_PC2MFP_Msk        /*!< UART2_nCTS      PC2      MFP Mask */
#define UART2_nCTS_PF5_Msk      SYS_GPF_MFPL_PF5MFP_Msk        /*!< UART2_nCTS      PF5      MFP Mask */
#define UART2_nRTS_PC3_Msk      SYS_GPC_MFPL_PC3MFP_Msk        /*!< UART2_nRTS      PC3      MFP Mask */
#define UART2_nRTS_PF4_Msk      SYS_GPF_MFPL_PF4MFP_Msk        /*!< UART2_nRTS      PF4      MFP Mask */
#define VDET_P0_PB0_Msk         SYS_GPB_MFPL_PB0MFP_Msk        /*!< VDET_P0         PB0      MFP Mask */
#define VDET_P1_PB1_Msk         SYS_GPB_MFPL_PB1MFP_Msk        /*!< VDET_P1         PB1      MFP Mask */
#define X32_IN_PF5_Msk          SYS_GPF_MFPL_PF5MFP_Msk        /*!< X32_IN          PF5      MFP Mask */
#define X32_OUT_PF4_Msk         SYS_GPF_MFPL_PF4MFP_Msk        /*!< X32_OUT         PF4      MFP Mask */
#define XT1_IN_PF3_Msk          SYS_GPF_MFPL_PF3MFP_Msk        /*!< XT1_IN          PF3      MFP Mask */
#define XT1_OUT_PF2_Msk         SYS_GPF_MFPL_PF2MFP_Msk        /*!< XT1_OUT         PF2      MFP Mask */


/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */

