OpenNuvoton/NuTool-PinConfigure/Header/NUC1263/sys.h
/** @addtogroup SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/

/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function macro definitions.                                                                      */
/*---------------------------------------------------------------------------------------------------------*/

#define SET_ACMP0_N_PB4()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP0_N_PB4_Msk)) | ACMP0_N_PB4              /*!< Set PB4 function to ACMP0_N          */
#define SET_ACMP0_O_PB7()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP0_O_PB7_Msk)) | ACMP0_O_PB7              /*!< Set PB7 function to ACMP0_O          */
#define SET_ACMP0_O_PC1()        SYS->GPC_MFPL = (SYS->GPC_MFPL & (~ACMP0_O_PC1_Msk)) | ACMP0_O_PC1              /*!< Set PC1 function to ACMP0_O          */
#define SET_ACMP0_O_PF0()        SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP0_O_PF0_Msk)) | ACMP0_O_PF0              /*!< Set PF0 function to ACMP0_O          */
#define SET_ACMP0_P0_PB2()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP0_P0_PB2_Msk)) | ACMP0_P0_PB2            /*!< Set PB2 function to ACMP0_P0         */
#define SET_ACMP0_P1_PB3()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP0_P1_PB3_Msk)) | ACMP0_P1_PB3            /*!< Set PB3 function to ACMP0_P1         */
#define SET_ACMP0_P2_PB12()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP0_P2_PB12_Msk)) | ACMP0_P2_PB12          /*!< Set PB12 function to ACMP0_P2        */
#define SET_ACMP0_P3_PB13()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP0_P3_PB13_Msk)) | ACMP0_P3_PB13          /*!< Set PB13 function to ACMP0_P3        */
#define SET_ACMP0_WLAT_PA7()     SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP0_WLAT_PA7_Msk)) | ACMP0_WLAT_PA7        /*!< Set PA7 function to ACMP0_WLAT       */
#define SET_ACMP1_N_PB5()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP1_N_PB5_Msk)) | ACMP1_N_PB5              /*!< Set PB5 function to ACMP1_N          */
#define SET_ACMP1_O_PB6()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP1_O_PB6_Msk)) | ACMP1_O_PB6              /*!< Set PB6 function to ACMP1_O          */
#define SET_ACMP1_O_PC0()        SYS->GPC_MFPL = (SYS->GPC_MFPL & (~ACMP1_O_PC0_Msk)) | ACMP1_O_PC0              /*!< Set PC0 function to ACMP1_O          */
#define SET_ACMP1_O_PF1()        SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP1_O_PF1_Msk)) | ACMP1_O_PF1              /*!< Set PF1 function to ACMP1_O          */
#define SET_ACMP1_P0_PB3()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP1_P0_PB3_Msk)) | ACMP1_P0_PB3            /*!< Set PB3 function to ACMP1_P0         */
#define SET_ACMP1_P1_PB4()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP1_P1_PB4_Msk)) | ACMP1_P1_PB4            /*!< Set PB4 function to ACMP1_P1         */
#define SET_ACMP1_P2_PB12()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP1_P2_PB12_Msk)) | ACMP1_P2_PB12          /*!< Set PB12 function to ACMP1_P2        */
#define SET_ACMP1_P3_PB13()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP1_P3_PB13_Msk)) | ACMP1_P3_PB13          /*!< Set PB13 function to ACMP1_P3        */
#define SET_ACMP1_WLAT_PA6()     SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP1_WLAT_PA6_Msk)) | ACMP1_WLAT_PA6        /*!< Set PA6 function to ACMP1_WLAT       */
#define SET_ACMP2_N_PB6()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP2_N_PB6_Msk)) | ACMP2_N_PB6              /*!< Set PB6 function to ACMP2_N          */
#define SET_ACMP2_O_PA1()        SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP2_O_PA1_Msk)) | ACMP2_O_PA1              /*!< Set PA1 function to ACMP2_O          */
#define SET_ACMP2_O_PF3()        SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP2_O_PF3_Msk)) | ACMP2_O_PF3              /*!< Set PF3 function to ACMP2_O          */
#define SET_ACMP2_P0_PB4()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP2_P0_PB4_Msk)) | ACMP2_P0_PB4            /*!< Set PB4 function to ACMP2_P0         */
#define SET_ACMP2_P1_PB5()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP2_P1_PB5_Msk)) | ACMP2_P1_PB5            /*!< Set PB5 function to ACMP2_P1         */
#define SET_ACMP2_P2_PB14()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP2_P2_PB14_Msk)) | ACMP2_P2_PB14          /*!< Set PB14 function to ACMP2_P2        */
#define SET_ACMP2_P3_PB15()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP2_P3_PB15_Msk)) | ACMP2_P3_PB15          /*!< Set PB15 function to ACMP2_P3        */
#define SET_ACMP2_WLAT_PA3()     SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP2_WLAT_PA3_Msk)) | ACMP2_WLAT_PA3        /*!< Set PA3 function to ACMP2_WLAT       */
#define SET_ACMP2_WLAT_PF5()     SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP2_WLAT_PF5_Msk)) | ACMP2_WLAT_PF5        /*!< Set PF5 function to ACMP2_WLAT       */
#define SET_ACMP3_N_PB7()        SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP3_N_PB7_Msk)) | ACMP3_N_PB7              /*!< Set PB7 function to ACMP3_N          */
#define SET_ACMP3_O_PA0()        SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP3_O_PA0_Msk)) | ACMP3_O_PA0              /*!< Set PA0 function to ACMP3_O          */
#define SET_ACMP3_O_PF2()        SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP3_O_PF2_Msk)) | ACMP3_O_PF2              /*!< Set PF2 function to ACMP3_O          */
#define SET_ACMP3_P0_PB5()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP3_P0_PB5_Msk)) | ACMP3_P0_PB5            /*!< Set PB5 function to ACMP3_P0         */
#define SET_ACMP3_P1_PB6()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ACMP3_P1_PB6_Msk)) | ACMP3_P1_PB6            /*!< Set PB6 function to ACMP3_P1         */
#define SET_ACMP3_P2_PB14()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP3_P2_PB14_Msk)) | ACMP3_P2_PB14          /*!< Set PB14 function to ACMP3_P2        */
#define SET_ACMP3_P3_PB15()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ACMP3_P3_PB15_Msk)) | ACMP3_P3_PB15          /*!< Set PB15 function to ACMP3_P3        */
#define SET_ACMP3_WLAT_PF4()     SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ACMP3_WLAT_PF4_Msk)) | ACMP3_WLAT_PF4        /*!< Set PF4 function to ACMP3_WLAT       */
#define SET_ACMP3_WLAT_PA2()     SYS->GPA_MFPL = (SYS->GPA_MFPL & (~ACMP3_WLAT_PA2_Msk)) | ACMP3_WLAT_PA2        /*!< Set PA2 function to ACMP3_WLAT       */
#define SET_ADC0_CH0_PB0()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH0_PB0_Msk)) | ADC0_CH0_PB0            /*!< Set PB0 function to ADC0_CH0         */
#define SET_ADC0_CH1_PB1()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH1_PB1_Msk)) | ADC0_CH1_PB1            /*!< Set PB1 function to ADC0_CH1         */
#define SET_ADC0_CH10_PB10()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH10_PB10_Msk)) | ADC0_CH10_PB10        /*!< Set PB10 function to ADC0_CH10       */
#define SET_ADC0_CH11_PB11()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH11_PB11_Msk)) | ADC0_CH11_PB11        /*!< Set PB11 function to ADC0_CH11       */
#define SET_ADC0_CH12_PB12()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH12_PB12_Msk)) | ADC0_CH12_PB12        /*!< Set PB12 function to ADC0_CH12       */
#define SET_ADC0_CH13_PB13()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH13_PB13_Msk)) | ADC0_CH13_PB13        /*!< Set PB13 function to ADC0_CH13       */
#define SET_ADC0_CH14_PB14()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH14_PB14_Msk)) | ADC0_CH14_PB14        /*!< Set PB14 function to ADC0_CH14       */
#define SET_ADC0_CH15_PB15()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH15_PB15_Msk)) | ADC0_CH15_PB15        /*!< Set PB15 function to ADC0_CH15       */
#define SET_ADC0_CH2_PB2()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH2_PB2_Msk)) | ADC0_CH2_PB2            /*!< Set PB2 function to ADC0_CH2         */
#define SET_ADC0_CH3_PB3()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH3_PB3_Msk)) | ADC0_CH3_PB3            /*!< Set PB3 function to ADC0_CH3         */
#define SET_ADC0_CH4_PB4()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH4_PB4_Msk)) | ADC0_CH4_PB4            /*!< Set PB4 function to ADC0_CH4         */
#define SET_ADC0_CH5_PB5()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH5_PB5_Msk)) | ADC0_CH5_PB5            /*!< Set PB5 function to ADC0_CH5         */
#define SET_ADC0_CH6_PB6()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH6_PB6_Msk)) | ADC0_CH6_PB6            /*!< Set PB6 function to ADC0_CH6         */
#define SET_ADC0_CH7_PB7()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~ADC0_CH7_PB7_Msk)) | ADC0_CH7_PB7            /*!< Set PB7 function to ADC0_CH7         */
#define SET_ADC0_CH8_PB8()       SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH8_PB8_Msk)) | ADC0_CH8_PB8            /*!< Set PB8 function to ADC0_CH8         */
#define SET_ADC0_CH9_PB9()       SYS->GPB_MFPH = (SYS->GPB_MFPH & (~ADC0_CH9_PB9_Msk)) | ADC0_CH9_PB9            /*!< Set PB9 function to ADC0_CH9         */
#define SET_ADC0_ST_PF5()        SYS->GPF_MFPL = (SYS->GPF_MFPL & (~ADC0_ST_PF5_Msk)) | ADC0_ST_PF5              /*!< Set PF5 function to ADC0_ST          */
#define SET_ADC0_ST_PC1()        SYS->GPC_MFPL = (SYS->GPC_MFPL & (~ADC0_ST_PC1_Msk)) | ADC0_ST_PC1              /*!< Set PC1 function to ADC0_ST          */
#define SET_BPWM0_CH0_PA0()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH0_PA0_Msk)) | BPWM0_CH0_PA0          /*!< Set PA0 function to BPWM0_CH0        */
#define SET_BPWM0_CH0_PA11()     SYS->GPA_MFPH = (SYS->GPA_MFPH & (~BPWM0_CH0_PA11_Msk)) | BPWM0_CH0_PA11        /*!< Set PA11 function to BPWM0_CH0       */
#define SET_BPWM0_CH1_PA10()     SYS->GPA_MFPH = (SYS->GPA_MFPH & (~BPWM0_CH1_PA10_Msk)) | BPWM0_CH1_PA10        /*!< Set PA10 function to BPWM0_CH1       */
#define SET_BPWM0_CH1_PA1()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH1_PA1_Msk)) | BPWM0_CH1_PA1          /*!< Set PA1 function to BPWM0_CH1        */
#define SET_BPWM0_CH2_PA2()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH2_PA2_Msk)) | BPWM0_CH2_PA2          /*!< Set PA2 function to BPWM0_CH2        */
#define SET_BPWM0_CH2_PA9()      SYS->GPA_MFPH = (SYS->GPA_MFPH & (~BPWM0_CH2_PA9_Msk)) | BPWM0_CH2_PA9          /*!< Set PA9 function to BPWM0_CH2        */
#define SET_BPWM0_CH3_PA3()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH3_PA3_Msk)) | BPWM0_CH3_PA3          /*!< Set PA3 function to BPWM0_CH3        */
#define SET_BPWM0_CH3_PF3()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM0_CH3_PF3_Msk)) | BPWM0_CH3_PF3          /*!< Set PF3 function to BPWM0_CH3        */
#define SET_BPWM0_CH3_PA8()      SYS->GPA_MFPH = (SYS->GPA_MFPH & (~BPWM0_CH3_PA8_Msk)) | BPWM0_CH3_PA8          /*!< Set PA8 function to BPWM0_CH3        */
#define SET_BPWM0_CH4_PA4()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH4_PA4_Msk)) | BPWM0_CH4_PA4          /*!< Set PA4 function to BPWM0_CH4        */
#define SET_BPWM0_CH4_PF5()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM0_CH4_PF5_Msk)) | BPWM0_CH4_PF5          /*!< Set PF5 function to BPWM0_CH4        */
#define SET_BPWM0_CH5_PA5()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM0_CH5_PA5_Msk)) | BPWM0_CH5_PA5          /*!< Set PA5 function to BPWM0_CH5        */
#define SET_BPWM0_CH5_PF4()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM0_CH5_PF4_Msk)) | BPWM0_CH5_PF4          /*!< Set PF4 function to BPWM0_CH5        */
#define SET_BPWM1_CH0_PB11()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM1_CH0_PB11_Msk)) | BPWM1_CH0_PB11        /*!< Set PB11 function to BPWM1_CH0       */
#define SET_BPWM1_CH0_PF3()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM1_CH0_PF3_Msk)) | BPWM1_CH0_PF3          /*!< Set PF3 function to BPWM1_CH0        */
#define SET_BPWM1_CH0_PC7()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM1_CH0_PC7_Msk)) | BPWM1_CH0_PC7          /*!< Set PC7 function to BPWM1_CH0        */
#define SET_BPWM1_CH0_PF0()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM1_CH0_PF0_Msk)) | BPWM1_CH0_PF0          /*!< Set PF0 function to BPWM1_CH0        */
#define SET_BPWM1_CH0_PF15()     SYS->GPF_MFPH = (SYS->GPF_MFPH & (~BPWM1_CH0_PF15_Msk)) | BPWM1_CH0_PF15        /*!< Set PF15 function to BPWM1_CH0       */
#define SET_BPWM1_CH1_PC6()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM1_CH1_PC6_Msk)) | BPWM1_CH1_PC6          /*!< Set PC6 function to BPWM1_CH1        */
#define SET_BPWM1_CH1_PF2()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM1_CH1_PF2_Msk)) | BPWM1_CH1_PF2          /*!< Set PF2 function to BPWM1_CH1        */
#define SET_BPWM1_CH1_PB10()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM1_CH1_PB10_Msk)) | BPWM1_CH1_PB10        /*!< Set PB10 function to BPWM1_CH1       */
#define SET_BPWM1_CH1_PF1()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM1_CH1_PF1_Msk)) | BPWM1_CH1_PF1          /*!< Set PF1 function to BPWM1_CH1        */
#define SET_BPWM1_CH2_PA7()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM1_CH2_PA7_Msk)) | BPWM1_CH2_PA7          /*!< Set PA7 function to BPWM1_CH2        */
#define SET_BPWM1_CH2_PB9()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM1_CH2_PB9_Msk)) | BPWM1_CH2_PB9          /*!< Set PB9 function to BPWM1_CH2        */
#define SET_BPWM1_CH3_PA6()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM1_CH3_PA6_Msk)) | BPWM1_CH3_PA6          /*!< Set PA6 function to BPWM1_CH3        */
#define SET_BPWM1_CH3_PB8()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM1_CH3_PB8_Msk)) | BPWM1_CH3_PB8          /*!< Set PB8 function to BPWM1_CH3        */
#define SET_BPWM1_CH4_PB7()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM1_CH4_PB7_Msk)) | BPWM1_CH4_PB7          /*!< Set PB7 function to BPWM1_CH4        */
#define SET_BPWM1_CH5_PB6()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM1_CH5_PB6_Msk)) | BPWM1_CH5_PB6          /*!< Set PB6 function to BPWM1_CH5        */
#define SET_BPWM2_CH0_PA5()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH0_PA5_Msk)) | BPWM2_CH0_PA5          /*!< Set PA5 function to BPWM2_CH0        */
#define SET_BPWM2_CH0_PF5()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM2_CH0_PF5_Msk)) | BPWM2_CH0_PF5          /*!< Set PF5 function to BPWM2_CH0        */
#define SET_BPWM2_CH0_PB5()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH0_PB5_Msk)) | BPWM2_CH0_PB5          /*!< Set PB5 function to BPWM2_CH0        */
#define SET_BPWM2_CH1_PF4()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM2_CH1_PF4_Msk)) | BPWM2_CH1_PF4          /*!< Set PF4 function to BPWM2_CH1        */
#define SET_BPWM2_CH1_PA4()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH1_PA4_Msk)) | BPWM2_CH1_PA4          /*!< Set PA4 function to BPWM2_CH1        */
#define SET_BPWM2_CH1_PB4()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH1_PB4_Msk)) | BPWM2_CH1_PB4          /*!< Set PB4 function to BPWM2_CH1        */
#define SET_BPWM2_CH1_PC1()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM2_CH1_PC1_Msk)) | BPWM2_CH1_PC1          /*!< Set PC1 function to BPWM2_CH1        */
#define SET_BPWM2_CH2_PA3()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH2_PA3_Msk)) | BPWM2_CH2_PA3          /*!< Set PA3 function to BPWM2_CH2        */
#define SET_BPWM2_CH2_PB3()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH2_PB3_Msk)) | BPWM2_CH2_PB3          /*!< Set PB3 function to BPWM2_CH2        */
#define SET_BPWM2_CH3_PA2()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH3_PA2_Msk)) | BPWM2_CH3_PA2          /*!< Set PA2 function to BPWM2_CH3        */
#define SET_BPWM2_CH3_PB2()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH3_PB2_Msk)) | BPWM2_CH3_PB2          /*!< Set PB2 function to BPWM2_CH3        */
#define SET_BPWM2_CH4_PB1()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH4_PB1_Msk)) | BPWM2_CH4_PB1          /*!< Set PB1 function to BPWM2_CH4        */
#define SET_BPWM2_CH4_PF6()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM2_CH4_PF6_Msk)) | BPWM2_CH4_PF6          /*!< Set PF6 function to BPWM2_CH4        */
#define SET_BPWM2_CH4_PF14()     SYS->GPF_MFPH = (SYS->GPF_MFPH & (~BPWM2_CH4_PF14_Msk)) | BPWM2_CH4_PF14        /*!< Set PF14 function to BPWM2_CH4       */
#define SET_BPWM2_CH4_PA1()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH4_PA1_Msk)) | BPWM2_CH4_PA1          /*!< Set PA1 function to BPWM2_CH4        */
#define SET_BPWM2_CH5_PD15()     SYS->GPD_MFPH = (SYS->GPD_MFPH & (~BPWM2_CH5_PD15_Msk)) | BPWM2_CH5_PD15        /*!< Set PD15 function to BPWM2_CH5       */
#define SET_BPWM2_CH5_PA0()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM2_CH5_PA0_Msk)) | BPWM2_CH5_PA0          /*!< Set PA0 function to BPWM2_CH5        */
#define SET_BPWM2_CH5_PB0()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM2_CH5_PB0_Msk)) | BPWM2_CH5_PB0          /*!< Set PB0 function to BPWM2_CH5        */
#define SET_BPWM2_CH5_PF4()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM2_CH5_PF4_Msk)) | BPWM2_CH5_PF4          /*!< Set PF4 function to BPWM2_CH5        */
#define SET_BPWM3_CH0_PC5()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH0_PC5_Msk)) | BPWM3_CH0_PC5          /*!< Set PC5 function to BPWM3_CH0        */
#define SET_BPWM3_CH0_PB15()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM3_CH0_PB15_Msk)) | BPWM3_CH0_PB15        /*!< Set PB15 function to BPWM3_CH0       */
#define SET_BPWM3_CH1_PB14()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM3_CH1_PB14_Msk)) | BPWM3_CH1_PB14        /*!< Set PB14 function to BPWM3_CH1       */
#define SET_BPWM3_CH1_PC4()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH1_PC4_Msk)) | BPWM3_CH1_PC4          /*!< Set PC4 function to BPWM3_CH1        */
#define SET_BPWM3_CH2_PB13()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM3_CH2_PB13_Msk)) | BPWM3_CH2_PB13        /*!< Set PB13 function to BPWM3_CH2       */
#define SET_BPWM3_CH2_PC7()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH2_PC7_Msk)) | BPWM3_CH2_PC7          /*!< Set PC7 function to BPWM3_CH2        */
#define SET_BPWM3_CH2_PC3()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH2_PC3_Msk)) | BPWM3_CH2_PC3          /*!< Set PC3 function to BPWM3_CH2        */
#define SET_BPWM3_CH3_PB12()     SYS->GPB_MFPH = (SYS->GPB_MFPH & (~BPWM3_CH3_PB12_Msk)) | BPWM3_CH3_PB12        /*!< Set PB12 function to BPWM3_CH3       */
#define SET_BPWM3_CH3_PC0()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH3_PC0_Msk)) | BPWM3_CH3_PC0          /*!< Set PC0 function to BPWM3_CH3        */
#define SET_BPWM3_CH3_PC2()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH3_PC2_Msk)) | BPWM3_CH3_PC2          /*!< Set PC2 function to BPWM3_CH3        */
#define SET_BPWM3_CH3_PC6()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH3_PC6_Msk)) | BPWM3_CH3_PC6          /*!< Set PC6 function to BPWM3_CH3        */
#define SET_BPWM3_CH4_PC1()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH4_PC1_Msk)) | BPWM3_CH4_PC1          /*!< Set PC1 function to BPWM3_CH4        */
#define SET_BPWM3_CH4_PA7()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM3_CH4_PA7_Msk)) | BPWM3_CH4_PA7          /*!< Set PA7 function to BPWM3_CH4        */
#define SET_BPWM3_CH4_PB7()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM3_CH4_PB7_Msk)) | BPWM3_CH4_PB7          /*!< Set PB7 function to BPWM3_CH4        */
#define SET_BPWM3_CH4_PB1()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM3_CH4_PB1_Msk)) | BPWM3_CH4_PB1          /*!< Set PB1 function to BPWM3_CH4        */
#define SET_BPWM3_CH5_PB6()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM3_CH5_PB6_Msk)) | BPWM3_CH5_PB6          /*!< Set PB6 function to BPWM3_CH5        */
#define SET_BPWM3_CH5_PF4()      SYS->GPF_MFPL = (SYS->GPF_MFPL & (~BPWM3_CH5_PF4_Msk)) | BPWM3_CH5_PF4          /*!< Set PF4 function to BPWM3_CH5        */
#define SET_BPWM3_CH5_PC0()      SYS->GPC_MFPL = (SYS->GPC_MFPL & (~BPWM3_CH5_PC0_Msk)) | BPWM3_CH5_PC0          /*!< Set PC0 function to BPWM3_CH5        */
#define SET_BPWM3_CH5_PA6()      SYS->GPA_MFPL = (SYS->GPA_MFPL & (~BPWM3_CH5_PA6_Msk)) | BPWM3_CH5_PA6          /*!< Set PA6 function to BPWM3_CH5        */
#define SET_BPWM3_CH5_PB0()      SYS->GPB_MFPL = (SYS->GPB_MFPL & (~BPWM3_CH5_PB0_Msk)) | BPWM3_CH5_PB0          /*!< Set PB0 function to BPWM3_CH5        */
#define SET_CLKO_PF6()           SYS->GPF_MFPL = (SYS->GPF_MFPL & (~CLKO_PF6_Msk)) | CLKO_PF6                    /*!< Set PF6 function to CLKO             */
#define SET_CLKO_PB14()          SYS->GPB_MFPH = (SYS->GPB_MFPH & (~CLKO_PB14_Msk)) | CLKO_PB14                  /*!< Set PB14 function to CLKO            */
#define SET_CLKO_PF14()          SYS->GPF_MFPH = (SYS->GPF_MFPH & (~CLKO_PF14_Msk)) | CLKO_PF14                  /*!< Set PF14 function to CLKO            */
#define SET_CLKO_PA3()           SYS->GPA_MFPL = (SYS->GPA_MFPL & (~CLKO_PA3_Msk)) | CLKO_PA3                    /*!< Set PA3 function to CLKO             */
#define SET_CLKO_PF15()          SYS->GPF_MFPH = (SYS->GPF_MFPH & (~CLKO_PF15_Msk)) | CLKO_PF15                  /*!< Set PF15 function to CLKO            */
#define SET_DAC0_OUT_PB12()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~DAC0_OUT_PB12_Msk)) | DAC0_OUT_PB12          /*!< Set PB12 function to DAC0_OUT        */
#define SET_DAC0_ST_PA10()       SYS->GPA_MFPH = (SYS->GPA_MFPH & (~DAC0_ST_PA10_Msk)) | DAC0_ST_PA10            /*!< Set PA10 function to DAC0_ST         */
#define SET_DAC0_ST_PA0()        SYS->GPA_MFPL = (SYS->GPA_MFPL & (~DAC0_ST_PA0_Msk)) | DAC0_ST_PA0              /*!< Set PA0 function to DAC0_ST          */
#define SET_DAC1_OUT_PB13()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~DAC1_OUT_PB13_Msk)) | DAC1_OUT_PB13          /*!< Set PB13 function to DAC1_OUT        */
#define SET_DAC1_ST_PC14()       SYS->GPC_MFPH = (SYS->GPC_MFPH & (~DAC1_ST_PC14_Msk)) | DAC1_ST_PC14            /*!< Set PC14 function to DAC1_ST         */
#define SET_DAC1_ST_PA11()       SYS->GPA_MFPH = (SYS->GPA_MFPH & (~DAC1_ST_PA11_Msk)) | DAC1_ST_PA11            /*!< Set PA11 function to DAC1_ST         */
#define SET_DAC2_OUT_PB14()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~DAC2_OUT_PB14_Msk)) | DAC2_OUT_PB14          /*!< Set PB14 function to DAC2_OUT        */
#define SET_DAC2_ST_PA9()        SYS->GPA_MFPH = (SYS->GPA_MFPH & (~DAC2_ST_PA9_Msk)) | DAC2_ST_PA9              /*!< Set PA9 function to DAC2_ST          */
#define SET_DAC2_ST_PA5()        SYS->GPA_MFPL = (SYS->GPA_MFPL & (~DAC2_ST_PA5_Msk)) | DAC2_ST_PA5              /*!< Set PA5 function to DAC2_ST          */
#define SET_DAC3_OUT_PB15()      SYS->GPB_MFPH = (SYS->GPB_MFPH & (~DAC3_OUT_PB15_Msk)) | DAC3_OUT_PB15          /*!< Set PB15 function to DAC3_OUT        */
#define SET_DAC3_ST_PA4()        SYS->GPA_MFPL = (SYS->GPA_MFPL & (~DAC3_ST_PA4_Msk)) | DAC3_ST_PA4              /*!< Set PA4 function to DAC3_ST          */
#define SET_DAC3_ST_PA8()        SYS->GPA_MFPH = (SYS->GPA_MFPH & (~DAC3_ST_PA8_Msk)) | DAC3_ST_PA8              /*!< Set PA8 function to DAC3_ST          */
#define SET_I2C0_SCL_PA8()       SYS->GPA_MFPH = (SYS->GPA_MFPH & (~I2C0_SCL_PA8_Msk)) | I2C0_SCL_PA8            /*!< Set PA8 function to I2C0_SCL         */
#define SET_I2C0_SCL_PB5()       SYS->GPB_MFPL = (SYS->GPB_MFPL & (~I2C0_SCL_PB5_Msk)) | I2C0_SCL_PB5            /*!< Set PB5 function to I2C0_SCL         */
#define SET_I2C0_SCL_PB9()       SYS->GPB_MFPH = (SYS->GPB_MFPH & (~I2C0_SCL_PB9_Msk)) | I2C0_SCL_PB9            /*!< Set PB9 function to I2C0_SCL         */
#define SET_I2C0_SCL_PF3()       SYS->GPF_MFPL = (SYS->GPF_MFPL & (~I2C0_SCL_PF3_Msk)) | I2C0_SCL_PF3            /*!< Set PF3 function to I2C0_SCL         */
#define SET_I2C0_SCL_PA5()       SYS->GPA_MFPL = (SYS->GPA_MFPL & (~I2C0_SCL_PA5_Msk)) | I2C0_SCL_PA5            /*!< Set PA5 function to I2C0_SCL         */
#define SET_I2C0_SCL_PC1()       SYS->GPC_MFPL = (SYS->GPC_MFPL & (~I2C0_SCL_PC1_Msk)) | I2C0_SCL_PC1            /*!< Set PC1 function to I2C0_SCL         */
#define SET_I2C0_SCL_PC3()       SYS->GPC_MFPL = (SYS->GPC_MFPL & (~I2C0_SCL_PC3_Msk)) | I2C0_SCL_PC3            /*!< Set PC3 function to I2C0_SCL         */
#define SET_I2C0_SCL_PF5()       SYS->GPF_MFPL = (SYS->GPF_MFPL & (~I2C0_SCL_PF5_Msk)) | I2C0_SCL_PF5            /*!< Set PF5 function to I2C0_SCL         */
#define SET_I2C0_SDA_PA4()       SYS->GPA_MFPL = (SYS->GPA_MFPL & (~I2C0_SDA_PA4_Msk)) | I2C0_SDA_PA4            /*!< Set PA4 function to I2C0_SDA         */
#define SET_I2C0_SDA_PF6()       SYS->GPF_MFPL = (SYS->GPF_MFPL & (~I2C0_SDA_PF6_Msk)) | I2C0_SDA_PF6            /*!< Set PF6 function to I2C0_SDA         */
#define SET_I2C0_SDA_PC0()       SYS->GPC_MFPL = (SYS->GPC_MFPL & (~I2C0_SDA_PC0_Msk)) | I2C0_SDA_PC0            /*!< Set PC0 function to I2C0_SDA         */
